{
    "video_id": "2AFaGJVg4HQ",
    "video_details": {
        "kind": "youtube#videoListResponse",
        "etag": "Dpx9S8EBaqOyGpa80xataYSYC5g",
        "items": [
            {
                "kind": "youtube#video",
                "etag": "K5Y2_yDN--AsN-664Dcxzc4qHnA",
                "id": "2AFaGJVg4HQ",
                "snippet": {
                    "publishedAt": "2010-12-02T04:02:20Z",
                    "channelId": "UCp6yMWT7VTXdHRxGQ3gOpLw",
                    "title": "Oh Flight Attendant, I Speak Jive.mp4",
                    "description": "Animated tribute to my favorite scene from Airplane!, the film.",
                    "thumbnails": {
                        "default": {
                            "url": "https://i.ytimg.com/vi/2AFaGJVg4HQ/default.jpg",
                            "width": 120,
                            "height": 90
                        },
                        "medium": {
                            "url": "https://i.ytimg.com/vi/2AFaGJVg4HQ/mqdefault.jpg",
                            "width": 320,
                            "height": 180
                        },
                        "high": {
                            "url": "https://i.ytimg.com/vi/2AFaGJVg4HQ/hqdefault.jpg",
                            "width": 480,
                            "height": 360
                        }
                    },
                    "channelTitle": "foxnews",
                    "tags": [
                        "Airplane!",
                        "animated",
                        "xtranormal",
                        "jive"
                    ],
                    "categoryId": "23",
                    "liveBroadcastContent": "none",
                    "localized": {
                        "title": "Oh Flight Attendant, I Speak Jive.mp4",
                        "description": "Animated tribute to my favorite scene from Airplane!, the film."
                    }
                },
                "contentDetails": {
                    "duration": "PT2M48S",
                    "dimension": "2d",
                    "definition": "sd",
                    "caption": "false",
                    "licensedContent": false,
                    "contentRating": {},
                    "projection": "rectangular"
                },
                "statistics": {
                    "viewCount": "1958",
                    "likeCount": "7",
                    "favoriteCount": "0",
                    "commentCount": "1"
                }
            }
        ],
        "pageInfo": {
            "totalResults": 1,
            "resultsPerPage": 1
        }
    },
    "video_transcript": "2010 marks the 30th anniversary of one of my favorite movies of all time airplane to mark this momentous occasion and to commemorate the passing of a comic genius mr. Leslie Nielsen as well as the recent passing of mrs. barbara billingsley my improv troupe presents the following retrospective our props to norm Gibson dental wyd two of the G best actors of all time with the least joy best names ever please enjoy suffering through our amatory enactment of our flavor it sorry favorite scenes sheet man dead honky must be messing my old lady got to be running coal upside down his head y'know hey yo my can diggit no ain't gonna lay no mo pig wrap up on you may I say a Scott subah SE iono say up Rita ji did the same ol same ol hey knock a sulfa pro slick graeme at a back lot before mast down I take TCB in man hey you know what they say see a bra to get dat booty akyem leg the smacking yakim cool gotta be she can I get you something Shimo felt by delaying me tender bone jacking me up tight may I'm sorry I don't understand Connie say can hang stewardess i speak jive oh good he said that he's in great pain and he wants to know if you can help him all right can you tell him just relax and I'll be back as soon as I can with some medicine just hang loose blood she gonna catch you up on now rebound on Ahmed side what it is big mama my mama didn't raise no dummy I dug her a app cop me some slack jack chunk don't want to help chump don't get to help jive ass dude don't got no brains anyhow Wow films sure used to exploit racist humor please join us next week as we reenact the comedic stylings of mr. Cheech Marin and mr. Thomas Chang unite errybody",
    "video_comments": [
        {
            "commenter_display_name": "@MerkabaStar",
            "commenter_channel_id": "UCfVfNtzTaC-1rNxQ1IOkw8w",
            "comment_text": "haha....great!",
            "likes_count": 0,
            "replies": []
        }
    ]
}