{
    "video_id": "GY1r30Xf_DM",
    "video_details": {
        "kind": "youtube#videoListResponse",
        "etag": "-FoAAH9uDPhocx4Zmnt-rOrhEHk",
        "items": [
            {
                "kind": "youtube#video",
                "etag": "oas5mbjtOj4CBRWGqwXS1wJlP_c",
                "id": "GY1r30Xf_DM",
                "snippet": {
                    "publishedAt": "2024-03-11T22:52:04Z",
                    "channelId": "UC16niRr50-MSBwiO3YDb3RA",
                    "title": "Bitcoin races to record high as big US investors pile in | BBC News",
                    "description": "The price of Bitcoin, the world's largest cryptocurrency, has hit a new all-time high, above $72,000.  The surge is being driven by US finance giants pouring billions into buying bitcoins.\n\nThe new record represents another dramatic moment in Bitcoin's turbulent history.   In recent years Bitcoin crashed in value after many traditional investors dismissed its rise as a speculative bubble. \n\nThe currency was invented in 2009 by a person calling themselves Satoshi Nakamoto - their true identity remains a mystery.  It was conceived as a means to create money for the internet with an anti-establishment ethos encouraging people to break from the existing power structure of financial institutions and governments.\n\nHowever, Bitcoin's new all-time high value is due to establishment firms pouring billions of dollars into acquiring it. This is possible because US regulators recently approved several spot Bitcoin Exchange-Traded Funds (ETFs). That allowed giant investment firms like Blackrock, Fidelity and Grayscale to sell products based on the price of Bitcoin. Between them, they have been buying hundreds of thousands of bitcoins, rapidly driving up the value.\n\nClive Myrie presents BBC News at Ten reporting by Joe Tidy.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
                    "thumbnails": {
                        "default": {
                            "url": "https://i.ytimg.com/vi/GY1r30Xf_DM/default.jpg",
                            "width": 120,
                            "height": 90
                        },
                        "medium": {
                            "url": "https://i.ytimg.com/vi/GY1r30Xf_DM/mqdefault.jpg",
                            "width": 320,
                            "height": 180
                        },
                        "high": {
                            "url": "https://i.ytimg.com/vi/GY1r30Xf_DM/hqdefault.jpg",
                            "width": 480,
                            "height": 360
                        },
                        "standard": {
                            "url": "https://i.ytimg.com/vi/GY1r30Xf_DM/sddefault.jpg",
                            "width": 640,
                            "height": 480
                        },
                        "maxres": {
                            "url": "https://i.ytimg.com/vi/GY1r30Xf_DM/maxresdefault.jpg",
                            "width": 1280,
                            "height": 720
                        }
                    },
                    "channelTitle": "BBC News",
                    "tags": [
                        "bbc",
                        "bbc news",
                        "news",
                        "world news",
                        "breaking news",
                        "us news",
                        "world",
                        "america",
                        "usa",
                        "usa news",
                        "india news",
                        "Virtual",
                        "currency",
                        "crypto",
                        "bitcoin",
                        "investment",
                        "US",
                        "United",
                        "States",
                        "billions",
                        "buying",
                        "gains",
                        "bubble",
                        "financial",
                        "authorities",
                        "assets",
                        "trading",
                        "high",
                        "record",
                        "trade",
                        "value",
                        "traditional",
                        "investors",
                        "asset",
                        "save",
                        "benefit",
                        "price",
                        "rise",
                        "fall",
                        "crash",
                        "Satoshi",
                        "Nakamoto",
                        "transactions",
                        "coins",
                        "demand",
                        "supply",
                        "deadline",
                        "ETF",
                        "dollars",
                        "banks",
                        "central",
                        "risk",
                        "threat",
                        "danger",
                        "millionaire",
                        "Myrie",
                        "speculation",
                        "speculate",
                        "gamble",
                        "bet",
                        "invest",
                        "sell",
                        "win",
                        "lose"
                    ],
                    "categoryId": "25",
                    "liveBroadcastContent": "none",
                    "localized": {
                        "title": "Bitcoin races to record high as big US investors pile in | BBC News",
                        "description": "The price of Bitcoin, the world's largest cryptocurrency, has hit a new all-time high, above $72,000.  The surge is being driven by US finance giants pouring billions into buying bitcoins.\n\nThe new record represents another dramatic moment in Bitcoin's turbulent history.   In recent years Bitcoin crashed in value after many traditional investors dismissed its rise as a speculative bubble. \n\nThe currency was invented in 2009 by a person calling themselves Satoshi Nakamoto - their true identity remains a mystery.  It was conceived as a means to create money for the internet with an anti-establishment ethos encouraging people to break from the existing power structure of financial institutions and governments.\n\nHowever, Bitcoin's new all-time high value is due to establishment firms pouring billions of dollars into acquiring it. This is possible because US regulators recently approved several spot Bitcoin Exchange-Traded Funds (ETFs). That allowed giant investment firms like Blackrock, Fidelity and Grayscale to sell products based on the price of Bitcoin. Between them, they have been buying hundreds of thousands of bitcoins, rapidly driving up the value.\n\nClive Myrie presents BBC News at Ten reporting by Joe Tidy.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews"
                    },
                    "defaultAudioLanguage": "en-GB"
                },
                "contentDetails": {
                    "duration": "PT2M16S",
                    "dimension": "2d",
                    "definition": "hd",
                    "caption": "false",
                    "licensedContent": true,
                    "contentRating": {},
                    "projection": "rectangular"
                },
                "statistics": {
                    "viewCount": "3155",
                    "likeCount": "102",
                    "favoriteCount": "0",
                    "commentCount": "68"
                }
            }
        ],
        "pageInfo": {
            "totalResults": 1,
            "resultsPerPage": 1
        }
    },
    "video_transcript": "the value of the cryptocurrency Bitcoin rised to an all-time high today the new price is above $72,000 earlier this year us Regulators made it easier for investors to trade the currency which has helped fuel the record-breaking run and now the UK's Financial Watchdog says it will loosen some of the rules too here's Joe tidy for the last two years lines charting the value of Bitcoin have mostly been in One Direction but in the last few weeks it's all changed almost hourly now this virtual currency is hitting new all-time highs the reason well it's mostly down to this place in January Traders from us investment Giants were given the green light by us Watchdogs to start selling products linked directly to bitcoin as a result they've spent billions buying up coins further stoking the fire today UK Financial authorities say they too are open to allowing some trading based on crypto assets some are now wondering just how far this virtual currency can go some people think that the potential of Bitcoin is to replace all other currencies and there are shops and restaurants like this one in London that accept Bitcoin I just bought this7 pound burger for example which was 0.9 Bitcoin but the way prices are going now who knows what it' be worth tomorrow I don't think we're going to see Bitcoin becoming a genuine currency what I think we're seeing it become is a recognized and potentially widely used investment asset people buying it to um save for the longer term and to benefit from the price Rises Bitcoin was created by an anonymous internet user in 2009 to make sending money is easier sending an email or without needing any financial institutions Bitcoin transactions are processed by a huge network of volunteers who use computers to check transactions as a reward they're automatically given new coins right now the demand for those coins seems to be higher than ever and many Bitcoin fans are celebrating their new found riches others though are wondering with caution which way the notoriously unpredictable line will go next Joe tidy BBC News",
    "video_comments": [
        {
            "commenter_display_name": "@ius1141",
            "commenter_channel_id": "UCF81VeB8pz-dgV1DDBGWfWg",
            "comment_text": "bitcoin is for people that do want to actually make anything",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@amazingdany",
            "commenter_channel_id": "UCI6FvD009QctgEZNWIo56Ag",
            "comment_text": "I gotta say that if I recognized its value at the beginning and invested in it, its massive riches would've probably ruined my life lottery winner-style! A blessing in disguise?😜 \n\nPersonally, the next bitcoin right now is... _artificial intelligence!_ I may have stepped on the AI boat just in time! 🤞🤞🤞\nI Invite others to get on it too!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-gi6eh5th9k",
            "commenter_channel_id": "UC_w81Zv8O1NOn5o4SpZYEBQ",
            "comment_text": "Trump ❤❤❤❤",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Godwins.",
            "commenter_channel_id": "UCFC6wkxklJv45x2-D9qv8OA",
            "comment_text": "THEN ......CRRRRRAAAAASSSSSH\nNCSWIC NOTHING",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Billy67",
            "commenter_channel_id": "UCDV_JZJZ2CSrFuJ-Krrui1g",
            "comment_text": "Making way for CBDCs.\n\nIt's a Revelation 13",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@joeg7435",
            "commenter_channel_id": "UCQgACTfFAWXlUm-XICAynvw",
            "comment_text": "What they forget to mention is the power required to mine bitcoin is more than some countrys use.",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@spiritusinfinitus",
                    "commenter_channel_id": "UClUwm-gmQrDPE6sCurI8vhg",
                    "comment_text": "It&#39;s less than the traditional banking system and all the infrastructure entailed. Less than air conditioners or Christmas lights. Last I saw it uses around 56% renewables which is better than most other industries. Also, bitcoin mining actively incentivises investment in renewables and the efficient use of stranded or currently wasted energy sources. Study Bitcoin more.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@klodiankilai",
            "commenter_channel_id": "UCHrv7ZptM0qYbg0C0MD8SiQ",
            "comment_text": "I also escaped because I was only bothered by being called by the last name Kili by many people here and there, because they confused me with the desolate Mr. Klodian Kili did not create any kind of concern for me, because even in some state and private documents they put my last name wrongly with the last name Kili, my name is Kilai and I am an only child and my parents were both orphans and they died before me many years in a car accident and I have been living alone since the age of 25.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@klodiankilai",
            "commenter_channel_id": "UCHrv7ZptM0qYbg0C0MD8SiQ",
            "comment_text": "The poor Klodian Kili who died a few days ago on February 18 of this year with a serious illness, we paid him all the respects from all the peoples of the globe and all the state segments of all the countries of the globe paid him the respects. Even the compensation that he demanded from 5 Enaljon only in monetary currency for any type of national monetary currency for any country and that we handed over a month or so ago in the first days of the month of January of this year 2024 that we are as a people that we are as well these of all the segments of the state employees of all the states who surrendered at the same time as us, the desert could not enjoy them, sin. May the sea be easy for the grace of his body that I spread grace in the sea. Since the compensation was delivered to you, from that moment until now, no one from all state segments in the entire hemisphere as well as from all the peoples has made a mistake that I would have heard and seen on television if someone had made a mistake. As a simple people who have been all my life and in the meantime I am a simple people, I gave my approval to the National Banks that I never benefited from the various types of wealth because I have seen all the time the affairs of mine and the only thing I had in my hand was the approval for the National Bank, while the whole hemisphere does not know how you could have been when we handed over the compensation to Mr. Klodian Kili, that you may have been even more of us who gave approval to the National Banks, and who may have set aside some of your personal economic benefits of various assets because you may have worked mentally with developments from the most different that you may have taken here and there with forms from the most different, but it's a shame Lumadhi that he couldn't enjoy them.\nSignature: Klodian Kilai\n                         With respect: Klodian Kilai memorial for Mr. Klodian Kili",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tuanoful",
            "commenter_channel_id": "UCZWAPjolkLKcLECF3Sm7YQA",
            "comment_text": "god damn it, either make it work or stop that speculative crap",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@JamesSmith-qs4hx",
            "commenter_channel_id": "UCYuPpekE_Wbi5elWlQDWd6w",
            "comment_text": "New study finds journalists score far lower in moral reasoning than they did 13 years ago.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@terpkilla6674",
            "commenter_channel_id": "UCuf0h4_f_ak94hza03q9BxA",
            "comment_text": "Buy never sell",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@LIONTAMER3D",
            "commenter_channel_id": "UC_vzUjy_y3KiYy4N333U1MA",
            "comment_text": "pump & dump In full effect",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@spiritusinfinitus",
            "commenter_channel_id": "UClUwm-gmQrDPE6sCurI8vhg",
            "comment_text": "Infinity divided by 21 million. There will only ever be 21m bitcoin and there isn't enough left for every millionaire to own one. In the middle of April the supply of newly created bitcoin halves from 900 per day to 450 per day. Meanwhile ETF firms like Blackrock are buying up 4000 plus coins per day. All while the politicians and Bank of England have a TARGET for UK GBP inflation is 2% and they celebrate getting it down to 4%. Do the maths. Which do you think will be the more sustainable long term option? Study Bitcoin.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@goldfinga786able",
            "commenter_channel_id": "UCmwXmIFJWmGMci5z2sItg7A",
            "comment_text": "Free Palestine",
            "likes_count": 3,
            "replies": []
        },
        {
            "commenter_display_name": "@DD12542",
            "commenter_channel_id": "UCLIErSa6gLsc4Od9P2ccX_w",
            "comment_text": "I lost over $80k when everything started to tank. Not because I was in an exchange that went belly up. I was just stupid to hold and because that's what everyone said. I'm still responsible. It just taught me to be a better investor now that I understand more of what could go wrong. It took me over two years of being in the market, I'm really grateful I found one source to recover my money, at least $10k profits weekly. Thanks Mrs Jenifer Jones",
            "likes_count": 5,
            "replies": [
                {
                    "commenter_display_name": "@JimmyAlbert-sq4fm",
                    "commenter_channel_id": "UCCLIiC6E0RdAVsu5kgxEt3w",
                    "comment_text": "Wow. I&#39;m a bit perplexed seeing her been mentioned here also Didn’t know she has been good to so many people too this is wonderful, i&#39;m in my fifth trade with her and it has been super.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@mitchellbenita-ug4vv",
                    "commenter_channel_id": "UCxK7kX8vyOvZWD190omd8IA",
                    "comment_text": "You trade with Jenifer Jones too? Wow that woman has been a blessing to me and my family.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@SnewJknows12",
                    "commenter_channel_id": "UCelzNZcVwWCsb4mZ6KvX5RQ",
                    "comment_text": "Investing has proven to be an incredibly beneficial decision. My cryptocurrency profits continue to play a substantial role in growing my overall wealth, reducing my reliance on my salary.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@Ichigo_482",
                    "commenter_channel_id": "UCywiUalOhP1M-qNq2SE-SNg",
                    "comment_text": "As a beginner what do I need to do? How can I get started, on which platform? If you know any please share. I&#39;m new at this, please how can I reach her?",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@ralphbruce477",
                    "commenter_channel_id": "UC0Yl_H4cCfOfWTl34AFtRSg",
                    "comment_text": "What impresses me most about Jenifer Jones is how well she explains basic concept of winning before actually letting you use her trade signals. This goes a long way to ensure winning trades.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@DD12542",
                    "commenter_channel_id": "UCLIErSa6gLsc4Od9P2ccX_w",
                    "comment_text": "she&#39;s mostly on Telegrams, using the user name",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@DD12542",
                    "commenter_channel_id": "UCLIErSa6gLsc4Od9P2ccX_w",
                    "comment_text": "JJINVESTS 💯  yeah ,,, thats it",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@AnamScout",
                    "commenter_channel_id": "UCmUSQS-_HUlCb1NIZYmpsbA",
                    "comment_text": "Most people are retiring this year and has nothing to show for. But I assure you it’s never late to get your financial life together again.. All thanks to Jenifer Jones for I and my family",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@BryanKerr1",
            "commenter_channel_id": "UCG1Z79nR1VT7VpRe0ciz7gQ",
            "comment_text": "Guys it's not a currency, that's an ancient debate now. Bitcoin is a store of value, use the digital gold narrative if that helps your viewers understand",
            "likes_count": 5,
            "replies": []
        },
        {
            "commenter_display_name": "@lutomson3496",
            "commenter_channel_id": "UCh1lRastFZMihlo2vcYJLsA",
            "comment_text": "it will drop again its volatile and cyclical..short it...",
            "likes_count": 2,
            "replies": [
                {
                    "commenter_display_name": "@TiraWind",
                    "commenter_channel_id": "UCXPZCs7MsnIhYqIlfuupuUw",
                    "comment_text": "Shorting it sounds dangerous at its current trajectory. ETFs are buying it up and the halving is approaching.",
                    "likes_count": 1
                }
            ]
        },
        {
            "commenter_display_name": "@georgemcdaniel4654",
            "commenter_channel_id": "UC98pzs13--cwlLJUIHF5vsw",
            "comment_text": "Good luck it's not physical and it actually hurts the environment. And it's just for Ritch people to burn money. And Good luck I don't think money will go away.  And Good luck with regulating it. That's what needs but that's the point of it. No regulating on it. Sow your poor sow f me.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@AnthonyEvans-gf8fd",
            "commenter_channel_id": "UCYcWI4z1OWX7Kpu-SLG_X8A",
            "comment_text": "If you have spent more than 30 hours studying this you'll see that every new story and its comments section are peppered with falsehoods and mischaracterisations.  The Overton window does seem to be shifting though...",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@pinarellolimoncello",
            "commenter_channel_id": "UC_ezrBMX3-a_0C4xSQkhoAg",
            "comment_text": "Hubris Hubris Hubris. So the financial sector shafted everyone back in 2007/8 and we're supposed to now put our faith,  not in honesty and good practice,  but a moody crypto currency that mysteriously appears out of nowhere like a night in shining armour, developed by a mysterious computer genius Sushi Nakamoto ,  come on please,  I cant be the only person in the world who stands up against ugly mug , adversary of mankind , satn. There are people still living on a dollar or 2 a day , what is bitcoin ever going to do for them , sober up you drunkards. And to the banks , you said we were all in it together, funny how that story has gone quiet. Bitcoin is for economic incompetents and boys , where are the real men who can step to running a proper honest and genuine economy?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Scapestoat",
            "commenter_channel_id": "UCpduUp0JIntRyFR_IhszHLQ",
            "comment_text": "The longest running ponzi scheme still hasn't run out of steam, it seems!",
            "likes_count": 1,
            "replies": [
                {
                    "commenter_display_name": "@-eurosplitsofficalclanchan6057",
                    "commenter_channel_id": "UCCPxBeLdX4Wn3INoVLYwozA",
                    "comment_text": "you mean the pound or the dollar?",
                    "likes_count": 6
                },
                {
                    "commenter_display_name": "@ImNoctica",
                    "commenter_channel_id": "UCABXROBECZtFRNB2RYFELcg",
                    "comment_text": "Who’s Ponzi scheme is it? Sensing jealousy at the fact you haven’t been able to see what’s in front of you for the past decade",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@terpkilla6674",
                    "commenter_channel_id": "UCuf0h4_f_ak94hza03q9BxA",
                    "comment_text": "Enjoy staying poor😂",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@Cr4y7-AegisInquisitor",
            "commenter_channel_id": "UCsMytZe8lRFPufSGFeZCjew",
            "comment_text": "Study Bitcoin.",
            "likes_count": 6,
            "replies": []
        },
        {
            "commenter_display_name": "@countroyhifi8730",
            "commenter_channel_id": "UCuVkpTpyNIScLiliQHfpgtA",
            "comment_text": "Only 1 way to go from here 〽️",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@joeg7435",
                    "commenter_channel_id": "UCQgACTfFAWXlUm-XICAynvw",
                    "comment_text": "Up after the harlfing",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@Mrcookiemonster515",
            "commenter_channel_id": "UCtKmmjUQ9v9Qu7u-olNT_xQ",
            "comment_text": "Goood day folks . Jesus Christ is returning soon, an if you want to be rapture ready, its pretty simple. 1. believe that Jesus died on the cross and spilled his own blood for are sins, was buried and rose on the third day from the dead in glory. 2. admit your a sinner and your need him to save you. 3. repent your sins on him and in faith and trust and believe in him to save you. Because as Scripture say. there be people left behind to face gods wraith and face the mark of the beast. were a person will have it on there right hand or forehead. so if you stay behind don’t take the mark satay in faith to Jesus. For this time will be hell on earth. but if you do get left you still get saved just believe in what Jesus did and do good and die for him in this time. Lucifer will force you to take it. Do not accept it choose death. i pray you and many get saved and my fellow christians spread the word. Jesus loves us and nothing can separate us from him and faith and grace gets us saved. salvation and eternal life is a free gift from god nothing we earned or gained. Please it is important to spread this message to many. Jesus is your only way to avoid it. the signs are showing, more disasters and wars and suffering has increase dramatically. i pray to all see the true and believe. not to mention the ellipses on April 8 maybe the final waring. lord watch all and take all and open there hearts to Jesus Christ amen",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ascgazz7347",
            "commenter_channel_id": "UCrhQN6EqtLeK27o3hqfEp0w",
            "comment_text": "So now more people will invest, push it up again, then it’ll crash again, the richest will get richer and the poorest will lose everything. \n\nThat’s what’s happened every bull season so far.",
            "likes_count": 2,
            "replies": [
                {
                    "commenter_display_name": "@rudir2258",
                    "commenter_channel_id": "UCdMZMLJUaKKSLKtYXuZwCXQ",
                    "comment_text": "No one has every lost money on btc with a 4 year time horizon.  Please read about the best performing asset of the last decade.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@animegtrailer5208",
                    "commenter_channel_id": "UCQ2_8drhBc3o2vusASpPHtw",
                    "comment_text": "Capitalism baby 😂😂",
                    "likes_count": 1
                },
                {
                    "commenter_display_name": "@ascgazz7347",
                    "commenter_channel_id": "UCrhQN6EqtLeK27o3hqfEp0w",
                    "comment_text": "@@animegtrailer5208 crypto bullshit, baby!",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@JamesSmith-qs4hx",
            "commenter_channel_id": "UCYuPpekE_Wbi5elWlQDWd6w",
            "comment_text": "Your daily reminder that Western governments fabricate social and political problems in order to justify the extension of state power (surveillance, imprisonment, etc.) over the majority of the population. This is anarcho-tyranny, as Sam Francis dubbed it.\r\n\r\nThere is no threat to \"mosques, faith schools and community centres\" in the UK. Nobody is trying to attack them. Most British people would probably be too scared to break wind, even silently, in the vicinity of a mosque, for fear of being arrested for some kind of hate crime.\r\n\r\nIn actual fact, the threats to national security and the majority are far more likely to lie within these places. But the government's definition of national security is not your definition or mine. Common sense and basic pattern recognition don't come in to it. The government wants to clamp down on the right, which is the only popular force capable of challenging its abysmal record on immigration, demographic change and a whole host of other social, political and economic issues. \r\n\r\nSo that's why they're spending £117 million: to conjure a non-existent threat into existence. The fact that they've spent the money will be used as justification for further extension of state power to combat \"extremism\" -- and by \"extremism\", of course, they mean us.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@AKAPART",
            "commenter_channel_id": "UCQbZxxpdsAgqMJFVYc7hwrw",
            "comment_text": "The lines have never been in one direction come back here in 10 years and $BTC will be over $1 million",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@east2w",
            "commenter_channel_id": "UC6s0ANVZoE8tg0wQD4_EQTg",
            "comment_text": "If we had a spot bit coin ISA in the UK it would help out the banks / government and most importantly the people save more. Why are we always so far behind 😢",
            "likes_count": 7,
            "replies": [
                {
                    "commenter_display_name": "@ascgazz7347",
                    "commenter_channel_id": "UCrhQN6EqtLeK27o3hqfEp0w",
                    "comment_text": "Look at other countries using crypto and see how well it’s going for them before you condemn the UK to the same MASSIVE INFLATION HIKES AND COLLAPSING ECONOMIES. <br><br>It’s not always bad to be behind. <br><br>SAM BANKMAN FRAUD, is one fat greasy thieving reason. <br><br>Crypto isn’t trustworthy until it’s regulated, and regulation destroys it, and it’s thousand weird offspring.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@Xusemeh",
                    "commenter_channel_id": "UCheWdiTdJ27UQqqX_axTSOQ",
                    "comment_text": "Because bitcoin is the easiest way to lose all your money aside from gambling",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@east2w",
                    "commenter_channel_id": "UC6s0ANVZoE8tg0wQD4_EQTg",
                    "comment_text": "@@Xusemeh today literally no person who bought bitcoin was at a loss. You only loose if you sell low so best to buy and hold for the future.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@MichelleSandra305",
            "commenter_channel_id": "UCISw1Ulpe86nRlkA_cfG12g",
            "comment_text": "I appreciate you and your content < Technical Analysis is good but I find It truly baffling that major crypto youtubers just look mostly at pure T.A and completely ignore the bigger narrative of why BTC is pumps/pumped and why the future outlook will be even rosier than it seems. It's kinda irresponsible to ignore the fact that each ETF launch so far has caused a major pump at the peaks of BTC. We were already on strong footing with historically high volume and almost pure whale pumps, narrowly avoiding a long-term bear market. More emphasis should be put into day trading as it is less affected by the unpredictable nature of the market. I have made over 8 btc from day trading with Marcus Anthony insights and charts his been one step ahead of other analysis…,..",
            "likes_count": 15,
            "replies": [
                {
                    "commenter_display_name": "@ChrisJames892",
                    "commenter_channel_id": "UCxZWEiEXvPVN82sX3JNpVDQ",
                    "comment_text": "I have seen a lot of Positive post about this Marcus Anthony. Please how do I reach him ?",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@MichelleSandra305",
                    "commenter_channel_id": "UCISw1Ulpe86nRlkA_cfG12g",
                    "comment_text": "He is Cus64,  in TE  L E G R AM..",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@ChrisJames892",
                    "commenter_channel_id": "UCxZWEiEXvPVN82sX3JNpVDQ",
                    "comment_text": "Thanks for sharing his details. I will reach out to him right way",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@ErlinTorres142",
                    "commenter_channel_id": "UCd_9sap8Iazcj2qinnSTYOg",
                    "comment_text": "A better way is to get proper guide!!!! The most important thing is the technicality and Marcus  keeps proving himself.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@KettyMorgan557",
                    "commenter_channel_id": "UChadGYtzO3ddCAFqYxGhg_g",
                    "comment_text": "What I appreciate about Marcus  is his ability to tailor strategies to individual needs. He recognizes that each investor has unique goals and risk tolerances, and he adapts her advice accordingly.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@CharlesRobinson41",
                    "commenter_channel_id": "UCXLa13q8JnTmyygV8zHoprQ",
                    "comment_text": "Mr Marcus strategy has normalized winning trades for me and it’s a huge milestone for me looking back to how it all started.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@Xcelcior6780",
            "commenter_channel_id": "UCVqYImg3liJlTFCkiAcGBRA",
            "comment_text": "Lol Pump & Dump Scheme😂😂😂,It Will Be Fun When It Starts Falling Again.",
            "likes_count": 3,
            "replies": [
                {
                    "commenter_display_name": "@rudir2258",
                    "commenter_channel_id": "UCdMZMLJUaKKSLKtYXuZwCXQ",
                    "comment_text": "Please educate yourself.  The &#39;pump and dump/ponzi/tulip mania slant is getting boring and dated.",
                    "likes_count": 3
                },
                {
                    "commenter_display_name": "@Scapestoat",
                    "commenter_channel_id": "UCpduUp0JIntRyFR_IhszHLQ",
                    "comment_text": "​@@rudir2258And yet no less accurate.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@leematthews6812",
                    "commenter_channel_id": "UCw39LtWz7T53ukpxi9oeBPg",
                    "comment_text": "Just like the stock market, eh?",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@ImNoctica",
                    "commenter_channel_id": "UCABXROBECZtFRNB2RYFELcg",
                    "comment_text": "Lowest bitcoin is likely to go from here is down to $68k again in 3 years time",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@terpkilla6674",
                    "commenter_channel_id": "UCuf0h4_f_ak94hza03q9BxA",
                    "comment_text": "Put your money and bet against it then",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@Professional_444",
            "commenter_channel_id": "UCNA7HObq4fL5W_VlC0CkNIw",
            "comment_text": "LOL",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@bgeery",
            "commenter_channel_id": "UCU_2VfkFcBgea3pOJAVSKpw",
            "comment_text": "Be the next idiot to pump it up.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jakebhenry2228",
            "commenter_channel_id": "UCXZmwjL9T5XOPjA5ih7YxJg",
            "comment_text": "Isn’t the sole theme of this current it has these moments where it rises in value but when it starts being invested in it collapses because there isn’t any way of regulating it?",
            "likes_count": 1,
            "replies": [
                {
                    "commenter_display_name": "@waynesarahburns3871",
                    "commenter_channel_id": "UCnPRycUwdnT2sr_6z83oVow",
                    "comment_text": "You notice how there was a massive crash and then all the big institutions decided it would allow trading in? They control the press, they talk it down, scaring people into selling while buying in the background. Criminal really but hey ho.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@Scapestoat",
                    "commenter_channel_id": "UCpduUp0JIntRyFR_IhszHLQ",
                    "comment_text": "Not so much that there is no way of regulating it, more so that its value is linked to how many people are buying it.<br>And when people stop buying it, its value can go to zero in a very short time.",
                    "likes_count": 1
                },
                {
                    "commenter_display_name": "@ImNoctica",
                    "commenter_channel_id": "UCABXROBECZtFRNB2RYFELcg",
                    "comment_text": "@@Scapestoatsame could be said about any store of wealth",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@BBXgames888",
            "commenter_channel_id": "UC0L3lODDwtiYHQKqEQhS6cQ",
            "comment_text": "I'm 2nd",
            "likes_count": 0,
            "replies": []
        }
    ]
}