{
    "video_id": "PIWNVT-DQlc",
    "video_details": {
        "kind": "youtube#videoListResponse",
        "etag": "wTR9l4G_qm9Y5ArnReqapk6pI_4",
        "items": [
            {
                "kind": "youtube#video",
                "etag": "344KAzOwO1A0s6E7ZJUIJAi_rgQ",
                "id": "PIWNVT-DQlc",
                "snippet": {
                    "publishedAt": "2024-03-11T22:25:56Z",
                    "channelId": "UCupvZG-5ko_eiXAupbDfxWw",
                    "title": "'Gold for prosecutors': Honig weighs in on 'Trump Employee 5'",
                    "description": "A longtime Mar-a-Lago employee who is a central witness in the investigation into former President Donald Trump's handling of classified documents is now speaking publicly. CNN's Elie Honig weighs in on his value to prosecutors.",
                    "thumbnails": {
                        "default": {
                            "url": "https://i.ytimg.com/vi/PIWNVT-DQlc/default.jpg",
                            "width": 120,
                            "height": 90
                        },
                        "medium": {
                            "url": "https://i.ytimg.com/vi/PIWNVT-DQlc/mqdefault.jpg",
                            "width": 320,
                            "height": 180
                        },
                        "high": {
                            "url": "https://i.ytimg.com/vi/PIWNVT-DQlc/hqdefault.jpg",
                            "width": 480,
                            "height": 360
                        },
                        "standard": {
                            "url": "https://i.ytimg.com/vi/PIWNVT-DQlc/sddefault.jpg",
                            "width": 640,
                            "height": 480
                        },
                        "maxres": {
                            "url": "https://i.ytimg.com/vi/PIWNVT-DQlc/maxresdefault.jpg",
                            "width": 1280,
                            "height": 720
                        }
                    },
                    "channelTitle": "CNN",
                    "tags": [
                        "trump",
                        "elie honig"
                    ],
                    "categoryId": "25",
                    "liveBroadcastContent": "none",
                    "defaultLanguage": "en",
                    "localized": {
                        "title": "'Gold for prosecutors': Honig weighs in on 'Trump Employee 5'",
                        "description": "A longtime Mar-a-Lago employee who is a central witness in the investigation into former President Donald Trump's handling of classified documents is now speaking publicly. CNN's Elie Honig weighs in on his value to prosecutors."
                    },
                    "defaultAudioLanguage": "en"
                },
                "contentDetails": {
                    "duration": "PT10M59S",
                    "dimension": "2d",
                    "definition": "hd",
                    "caption": "true",
                    "licensedContent": true,
                    "contentRating": {},
                    "projection": "rectangular"
                },
                "statistics": {
                    "viewCount": "106052",
                    "likeCount": "3376",
                    "favoriteCount": "0",
                    "commentCount": "937"
                }
            }
        ],
        "pageInfo": {
            "totalResults": 1,
            "resultsPerPage": 1
        }
    },
    "video_transcript": "AK ANDNN TOD EXCLUSIVE FIRSTHREVIOUSLY  OWN AD NTS CASE, IS P GOING ON THE ROUT WHAT  HEEHIND THE SCENES A MA AND HOWE FIVE INAMELEARDO SO TRUMP EMPLOM 'T NY REGULAR   PL STE THE CASERVIC TRUMP'IDA RESORTCTG SURET  RULL OF  BELONGINGS WERD FROM  PLACE TO PMEANNTMOVED HE SAAT ARE NOW PT KATENTZ, ORE  TRUMP'S KAITLAN C, THE STORY FO JOINING US AITLAN, IT START WITH YOUOWBUTL    SINCE  1OLD. ANDIMTHE CENTER O     DOCUMENTS CASEAND IS PRIVY Y  TH  INS, HE  A  TIMONY  SPECIAL COUNS TEAM AKEY THAT N     WHERE MAINUTLER TOLD UTHOW N THE   LOAD BOX  HE WAS ASKED BOT'S PLANE   FLORIDA  FSET TOEW JERSEY NODID   THAT EN  WAS TRUS TEAM, HIS  LEGAAS MEETI  MBHE FBI AT  MA AY HAD JU MED A SEARCH O FIEDTS, WHOOKI   KNOW BTH ORUMP'RNEY,AT  DOCUMELT NAUTHERS HAD MOVED MANY OW, WHWN AND REF    N RSINDICTME WAS AHELP WALT NA'  D AND EVER GOES DIPPENED IS WALT E  BOSS, W THEPRESIDEN I REM TH WITH IT KNOW HAD IS VEHICHE WAIT  N I ING MAR-SOEN  ENDED UP ALL THE  LL LUHA HAD A H OF FS.    NOTICEDUG  E OXWERE NTWHITS  BOXES.ATBER   DID YOU HAVME    AT THTHERE POTENTIALLY IO  OUE PILING THEUP. I REMEY WEAN,M ACK  G L  MANWA  >> THEY. ASKED ME IN THE  INTERVIEW AND I BELIEVE IT WAS  I TEND TO 15 IS WHAT I   REMEMBER. I KNOW THE   >> INVESTIGATORS, CORRECT?   >> AND WHEN YOU LOOK BACK ON  THAT, NOW, WHAT I HAD NO CLUE  UNTIL PROBABLY THE END OF JUNE, THERE'S A FEW DIFFERENT THINGS THAT HAPPEN THAT KIND OF OPENED MY EYES TO YOU KNOW,  SOMETHING'S GOING ON HERE SO  YOU GET THAT UNUSUAL REQUEST.  DID YOU EVER THINK TO YOURSELF  WHY WERE THERE SO MANY BOXES AT MAR-A-LAGO?   >> FOR ME. I'M JUST THINKING  OUT OF THE FORMER PRESIDENT AND HE HAS A LOT OF STUFF HE LIKES  TO LUG AROUND WITH THEM. I  NEVER WOULD'VE THOUGHT IT WAS  ANNG LIKE WHAT WE SEE  TESTIFY JAKE IT IS JUST A   REMARKABLE MOMENT. KAITLAN   COLLINS AND I'VE BEEN REPORTING ON THIS STORY ALONG WITH THE   REST OF OUR TEAM, BUT REPORTING ON THIS STORY FOR, FOR SO LONG  IN THIS MOMENT IT IS SO   REMARKABLE TO HEAR FROM SOMEONE WHO HAS NOT SPOKEN PUBLICLY  BEFORE, BUT CLEARLY JUST BY HIS PROXIMITY AND HIS LONG-STANDING TIME HI, GUYS AT THE FORMER   PRESIDENT'S CLUB WAS ABLE TO  PROVIDE SUCH VALUABLE  INFORMATION TO INVESTIGATORS  ABOUT WHAT WAS HAPPENING HERE  WHILE HEAL, HE HIMSELF, JAKE  WAS STILL PIECING THIS ALL  TOGETHER BEHIND THE SCENES   >> KATELYN POLANTZ, MOTHER QUIT HIS JOB AT MAR-A-LAGO IN ABOUT  A YEAR-AND-A-HALF AGO IN LATE  2022. Y COME FORWARD TO SHARE  HIS STORY NOW HE SAYS THAT HE  JUST WANTS TO TELL THE TRUTH.  JAKE, THAT WAS ONE OF THEM   MESSAGES THAT CAME ACROSS LOUD  AND CLEAR FROM BRIAN BUTLER  WHEN HE WAS SPEAKING TO KAITLAN COLLINS EARLIER TODAY, ONE OF  THE THINGS THAT MAKES HIM SO  UNIQUE IN THIS SITUATION AS A  WITNESS IS THAT NOT ONLY THIS  WITNESS NOT ONLY IS HE TRUMP   EMPLOYEE FIVE IN THAT  INDICTMENT, BUT HE ALSO IS  SOMEONE WHO IS USING A  DIFFERENT LAYER TO REPRESENT  HIM IN THIS CASE, HE'S REFUSED TO TAKE ANY POSSIBLE BOILER  THAT THE TRUMP TEAM COULD  PROVIDE HIM AND USED SOMEWHAT  HE KNEW SEPARATELY AS HIS WAY  OF SETTING HIM APART. AND NOW  HIS REFLECTION UPON THIS, A PAD IN THE PAST LAST YEAR, THE FBI  APPROACHED HIM IN HIS DRIVEWAY  ABOUT A YEAR AGO, JUST THIS   DAY, HE SAYING THAT TRUMP IS  DIVIDING THE NATION. IT'S  DIVIDED RELATIONSHIPS. HE'S HAD WITH OTHERS AND JUST NOW HE'S  PUTTING THE PUZZLE PIECES  TOGETHER HERE.  >> AND KAITLAN COLLINS, DID MR. BUTLER'S SAY HE FELT ANY  PRESSURE AT ALL FROM TRUMP OR   MAR-A-LAGO OR ANYONE AFFILIATED WITH THE FORMER PRESIDENT TO  NOT COOPERATE WITH SPECIAL  COUNSEL JACK SMITH'S TEAM IT  MAYBE NOT HAVE BEEN MAY NOT WAS EXPLICIT. IS THAT J BUT WHAT HE FELT PRESSURE ON WAS THE  ATTORNEY AND THE REASON THIS IS SO CRITICAL EGGS, THERE'S A  VERY CLEAR DIVIDE WHEN YOU LOOK AT THIS CASE OF WHO HAS AN  ATTORNEY THAT IS BEING PAID BY  TRUMP WORLD AND WHO IS PAYING  FOR THEIR OWN AND THE DIVERGENT PATHS THAT THEY HAVE TAKEN ON  THIS MISLEY, CARLOS DE   OLIVEIRA, WHO WAS HIS VERY   CLOSE FRIEND THAT KAITLAN  MENTIONED THERE. HE HAS AN   ATTORNEY WHO IS BEING PAID FOR  BY TRUMP'S WORLD. HE IS  SOMEONE WHO WAS INDICTED IN  THAT SUPERSEDING INDICTMENT.  AND I SHOULD NOTE THAT THESE  TWO HAVE NOT SPOKEN SINCE THEN  HE WAS INDICTED IN THAT FOR   LYING TO FEDERAL INVESTIGATORS  ABOUT WHAT HE KNEW AND WHAT HE  SAW BRIAN BUTLER ON THE OTHER  HAND, SAID THAT HE FACED   REPEATED REQUESTS AND ATTEMPTS  TO TRY TO KEEP HIM IN THAT  TRUMP FOLD WHEN IT CAME TO  HAVING A TRUMP ATTORNEY ITSELF. AND SO I THINK THAT IS A  CRITICAL DISTINCTION HERE,  JAKE, AS WE'VE SEEN, HOW   PEOPLE WHO LEAVE THIS ORBIT AND WHAT HAPPENS TO THEM. AND ONE  THING THAT I THINK IS REALLY  IMPORTANT IS THIS IS JUST A  REGULAR PERSON WHO WHO WAS   WORKING AT MAR-A-LAGO FOR 20   YEARS BY HAPPENSTANCE OF WHAT  HE SAW, WHAT HE WITNESSED, AND  WHAT HE WAS ASKED TO DO. HE HAS BECOME A WITNESS IN THIS  INVESTIGATION AND HAD FBI   INVESTIGATORS APPROACH HIM AND  SEEK HIM OUT. AND NOW HE HAS  SPOKEN TO THEM ON MULTIPLE  OCCASIONS, AS HE TOLD ME TODAY  DURING THIS REMARKABLE SIT DOWN FOUND THAT KAITLYN POLANTZ AND  I HAVE WITH HIM, HE SAID THAT,  YES, HE IS WILLING TO TESTIFY     SUMMER.   >> ALL RIGHT. KAITLAN COLLINS  AND KATELYN POLANTZ. THANKS SO  MUCH AND LOOK FOR MUCH MORE ON  THIS EXCLUSIVE INTERVIEW FROM  KAITLAN COLLINS IN JUST A FEW  HOURS ON HER SHOW. THE SOURCE  THAT'S TONIGHT AT NINE EASTERN HERE ON CNN. I WANT TO BRING IN CNN SENIOR LEGAL ANALYST FORMER FEDERAL PROSECUTOR ELIE HONIG  TO DISCUSS ELIE, HOW IMPORTANT  IS THIS NEWS? HOW IMPORTANT IS  BRIAN BUTLER'S TESTIMONY FOR  THE SPECIAL COUNSEL'S TEAM  BUILDING A CASE AGAINST TRUMP  AND HIS CO-DEFENDANTS. AND WAS  THERE ANY SIGNIFICANT AND WHAT  YOU HEARD HIM SAY, JUST THEM?   >> YEAH, JAKE SO THIS TYPE OF  WITNESS IS GOLD FOR PROSECUTORS AND THERE'S A FEW REASONS FOR  THAT. FIRST OF ALL, THIS PERSON HAS INSIDER ACCESS. HE IS  LITERALLY INSIDE THE ROOM AS  KAITLAN JUST LAID OUT. HE'S  THERE WHEN BOXES ARE BEING  LOADED ONTO THE PLANE AND ONE  OF THE CHALLENGES FOR  PROSECUTORS HERE IS EXPLAINING  EXACTLY WHERE THESE DOCUMENTS  WERE MOVED AND WHEN AND BY I  WHOM IN THIS PERSON CAN GIVE US EXACTLY WHY SECOND OF ALL,  HE'S A PERSON WHO APPEARS TO  BE UNBIASED. HE DOESN'T SEEM   TO HAVE ANY REASON TO HAVE AN  AX TO GRIND WITH DONALD TRUMP  AS KAITLAN SAID, HE'S A  LONGTIME TWO DECADES LONG  EMPLOYEE OF DONALD TRUMP AND  THE TRUMP ORGANIZATION, JUST  BASED ON THE SNIPPET THAT WE  JUST SAW, HE DOES NOT APPEAR TO BE ANGRY OR RESENTFUL TOWARDS  DONALD TRUMP. FINALLY, IF YOU  LOOK AT HIS TESTIMONY AND YOU  LOOK AT THE INDICTMENT, HE   APPEARS TO BE WELL CORROBORATED BY DOCUMENTS BY CERTAIN TEXT  CHAINS THAT ARE REFERENCED IN  THE INDICTMENT AND BY TESTIMONY OF SOME OF THE DEFENDANTS   THEMSELVES, WALT NAUTA AND  CARLOS DE OLIVIERA. SO THIS IS  REALLY THE KIND OF WITNESS THAT YOU WANT TO BUILD AROUND AS A  PROSECUTOR SO WHAT'S THE BASIC WORTH OF HIS TESTIMONY? HE CAN  ESTABLISH THE BOXES CAME IN. HE WAS NOT TOLD THAT THEY WERE   VALUABLE, HAD IMPORTANT STATE   SECRETS IN THEM AND HE JUST  TREATED THEM LIKE ANYTHING   ELSE. AND THEY WERE STORED IN  COMMON AREAS AND NOT STORED  WITH ANY POTENTIAL SECURITY?   >> YEAH. I THINK THAT'S PART OF IT. I THINK IT'S ALSO VERY  DAMNING IN PARTICULAR TO WALT  NAUTA AND MR. DE OLIVERA, WHO  ARE BOTH DEFENDANTS IN THIS  CASE BECAUSE THEY'RE DIRECTING HIM WHAT TO DO WITH THE BOXES.  AND IF YOU LOOK AT THE  INDICTMENT, JAKE, THIS GUY, MR. WHOSE REFERENCED IN THE  INDICTMENT AS EMPLOYEE FIVE,  HE'S IN THE MIDDLE OF OTHERS  THANKS TO HE'S A WITNESS  PRIMARILY, BUT FOR EXAMPLE,  WHEN IT COMES TIME TO TRY TO  CHECK OUT THE SURVEILLANCE  VIDEO, REMEMBER PART OF THIS  CASE IS THAT AT ONE POINT TRUMP AND THE OTHER DEFENDANTS WERE   TRYING TO FIGURE OUT WHAT DO WE HAVE ON THE SURVEILLANCE VIDEO? CAN WE DELETE IT? HE OVERHEARS  AND HE'S PART OF CONVERSATIONS ABOUT THAT AS WELL. SO I THINK  HE'S A MULTIFACETED WITNESS FOR PROSECUTORS   >> AND BUTLER DESCRIBES  MULTIPLE TIMES WAS OFFERED   ATTORNEYS PAID FOR BY TRUMP OR  THE TRUMP ORGANIZATION. HE SAYS HE WAS REPEATEDLY TOLD HE COULD ALWAYS GO BACK AND WORK FOR  TRUMP AS WELL AS OFFERED THINGS SUCH AS FREE GOLF TICKETS.  COULD ANY OF THAT BE SEEN AS  ATTEMPTS OF WITNESS TAMPERING?    >> SO THERE IS NO INDEPENDENT  CHARGE OF WITNESS TAMPERING IN  THE INDICTMENT HOWEVER, THAT  COULD STILL BE VERY VALUABLE  INFORMATION FOR PROSECUTORS TO  USE BECAUSE THE PATTERN IS  UNMISTAKABLE. WE'VE SEEN IT  AGAIN AND AGAIN IN THIS CASE,  IN OTHER TRUMP INVESTIGATIONS  THAT HE AND HIS ORGANIZATIONS  OFFER TO PICK UP THE LEGAL  BILLS THAT THEY SORT OF DANGLE  OTHER POTENTIAL REWARDS FOR  PEOPLE IF THEY STAY LOYAL. NOW  IT'S HARD TO CONNECT THAT  DIRECTLY IN A WAY WHERE IT CAN  CHARGE AND WE'VE NOT SEEN A   CHARGE HERE, BUT YOU CAN  ABSOLUTELY USE THAT AS A",
    "video_comments": [
        {
            "commenter_display_name": "@michaelh.sanders2388",
            "commenter_channel_id": "UCDybDNpLgwl6-O8HyaS1uBw",
            "comment_text": "It is insane that Mr. Megabucks didn't have a walk in safe for his beloved boxes of stolen documents and someone to catalog and store them in an accessible form.\nIf they were so important than why did he treat them like trash?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@mymindartwork822",
            "commenter_channel_id": "UCtA3aFiI2FT5DIElibR6yIw",
            "comment_text": "You can get away with crimes you just got to become the president 😂😂",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Rawkin_Dawg",
            "commenter_channel_id": "UCYl9Ue6mDe7TBDuukleBB7w",
            "comment_text": "Do you think Putin is upset that he didn’t get the classified documents Baby Donald promised him?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@JSx145",
            "commenter_channel_id": "UC07UlUotDzui5ZLlejjmUNA",
            "comment_text": "Don’t worry the judges will protect him… Trump will never make it to trial in the first place. Land of the Free and what not…",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@andrelegault5105",
            "commenter_channel_id": "UCBIezatR7oHVQ8IEPCSazag",
            "comment_text": "Trump’s thugs will scare the shit out of him so that he eventually changes his tune.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@robertbrooks6167",
            "commenter_channel_id": "UCs_jUWGN5f63YM8oq8Y2rtg",
            "comment_text": "Eric Trump in 2014: ‘We have all the funding we need out of Russia’? - Any documents missing?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@glennalexon1530",
            "commenter_channel_id": "UCGmz1Xe3iRKLVNrvXSJ2J_g",
            "comment_text": "Sounds like he didn’t look in the boxes, or have anything to say about what was in them, or whether they were the boxes in question. Other than that… great job, CNN.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jillmorris1012",
            "commenter_channel_id": "UCf0Jmi-tXMgE-P6lVUKBZYQ",
            "comment_text": "😂❤",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@TS-tw8om",
            "commenter_channel_id": "UCL17qyaYzNF5x1GYupCrKtA",
            "comment_text": "Why is Biden not being prosecuted? Why is CNN ok with Biden, who was not a president, having classified files at a school and in his garage? Oh yeah, because they are hypocrites.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@seolfor4797",
            "commenter_channel_id": "UCDjsT_2ClXzEPh3jXz_SL7g",
            "comment_text": "And all this news won’t matter at all",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@STXJRB17",
            "commenter_channel_id": "UCHdwjrYbQht1C7Yt16E21oA",
            "comment_text": "They forgot to mention he has X-ray vision and knew what the boxes he was moving contained",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@pmarlier",
            "commenter_channel_id": "UCMPvcB9Dc3XAKz3lSEpuxjQ",
            "comment_text": "Why do audio outside near a beach? Was an airport not available?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tentenbrink2400",
            "commenter_channel_id": "UC6tokjJlmeapXXyF30NjNCw",
            "comment_text": "Hagerman and this young woman are too closely attached to 45. When they on your video, I skip them.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@cvzphotography",
            "commenter_channel_id": "UC8zRNC0IhNPg1yGEmk24-lA",
            "comment_text": "Judge Canon is going to do Trump's bidding and dismiss the case. All of this is moot.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@Transgender-GirL",
            "commenter_channel_id": "UC269Cu8nWRvNuk_ngjcvFMw",
            "comment_text": "presidemT ...JoE r BiDEN ...🇺🇸🌟2024🌟🇺🇸\n🎈🎈🔵🔵🎈🎈🐴🐎...💙",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Transgender-GirL",
            "commenter_channel_id": "UC269Cu8nWRvNuk_ngjcvFMw",
            "comment_text": "🎈🔵🎈n so then please \"VoTE\" Hhuge Omega🔵BLU WAVEs🌊🌊🌊🌟2024🌟🇺🇸 too help us \"save\" Lifes, Freedom, Rights etc. inna America🇺🇸🎈🎈🔵🔵🎈🎈🐴🐎...💙",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@martindread6530",
            "commenter_channel_id": "UCZgnLLUgnaN5gdlFGXVOUSg",
            "comment_text": "Failed sham after sham.. next.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@doubleslit9513",
            "commenter_channel_id": "UCRHJihA0FlWRxA81hqPmduQ",
            "comment_text": "How I think about all those Trump supporters talking about Hillary’s e-mails and all mental gymnastics 🤸 they must be performing to avoid evidence like this. But the truth is, they wouldn’t care even if they were fully cognizant of all the evidence. Republicans don’t deal in good faith and haven’t done so for at least 40 years. B/C what they are aware of is that they represent the minority. And as such, all they really care about is winning at any price. \nThis is why social security is in danger. This is why we don’t have universal healthcare. This is why Ukraine is in danger and Taiwan is in desperate straits. This is why a two party system is scarcely better than a one party system. And this is why the electoral college is best game in town if you’re a republican. \nLastly, I’d just say that not all republicans are racists. But if you’re a racist, chances are you’re a republican.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-nm1ni1so4h",
            "commenter_channel_id": "UCSKL9syxe4IjxvmZXmUk7CA",
            "comment_text": "So we are going to ignore Biden and his boxes in his unlocked garage?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jaradshaw4723",
            "commenter_channel_id": "UCkZiSKSN80bBqo42is4He-w",
            "comment_text": "NO ONE CARES  There will not even be an America left if Biden wins due to civil or ww3,  or the stock market crashes. the only thing holding us up weekly.     the lower china goe4s, and we go, the closer to the snap the twig we standing on is.    then THE WEF 2020 HEAD LINE,    GREATH RESET SIGNED BY 197 HAPPENS.          \nBY THE TIME WE COME OUT, AND WARS DIE, THE AMERICA YOU KNEW IS GONE,\nROVEING GANGS OF KKK WILL TRAVEL FREELY AND BOLDING ACROSS THE LAND WE HAD PREVIEOUSLY LIBERATED.       CHINA RUSSIA IRAN WILL NOT LET US GET BACK ON OUR FEET,  SO WE FALL,   THEN ISREAL AND THE EU.    \n\nBUJT WHAT BIDEN HAS DONE,  DONALD J TRUMP AND ELON MUSK GOLDEN CHILD DNA SPLICED WITH BILL GAMES AND JEFF BESOS     COULDN'T NAVIGATE THE PATH  IN THIS PARTISAN BULLSHIT.  AND THE FACT THE RULE OF LAW, HAS BEEN USED POLITCIALLY THUS HAS NO AUTHORITY,    AND NO FUNDIMENTALIST AMERICAN    WOULD EVER SAY DIFFERENT.  \nCAN'T IGNORE DUE PROCESS TO GET TRUMP, THEN USE IT AGINST.    YOU LOST ALL AUTHORITY,     THE 1ST TIME  P;RESUMPTION OF GUILT WAS DONE BC OF  MEDIAL POLIZING NARRITIVES.      \n\nPROOF IS LOOK UP THE HISTORICAL RECORD   IN 10 BYEARS,  TRUMPS BEEN CONVICTED AND FOUND GUILTY OF 2 CIVIL CASES,   0  CRIMINAL.,           AND THE NEW YOURK CASE, IS NOT LAW,, IT DIRECTTLY VIOLATES THE LAW AND CONSITUTION BC NO TRIAL.    AND PRESUMPTION OF GUILT.\nJUDGE SAID IT WAS A SUMMARY JUDGEMENT,   IT WASN'T      FACTS OF THE CASE WERE BEING DISPUTED.     NAMELY WHAT WAS FAIR BETWEEN    LENDER AND LENDIE  WASN'T TILL THE GOVERNMENT SAID OTHER WISE.   THAT WAS DISPUTED THE ENTIRE TIME, AND TRUMP WASN'T WRONG..       IF YOU USE THAT JUDGLEMENT FOR PASS PRESENTSS THEN ER   EALISTATE    IN new yourk state is subject to the same ruling.      because no one can [ppredict the exact valkue of anything.    they don't know it.   esp in todays econ.    \n\nI will give you some heads up,    though  go back and watch the tape of court when that judge  said 400million.            THAT JUDGE IS GONNA GO MISSING MARK MY WORDS.   There was nothing but  abolishment in trumps eyes.  And they were stone cold steady and trained on that jdge.      He touched Trumps life work, and threaten it.,      \nidk about you but I'd trade 77 tears for what i had left. to go.   THINK OUT IT, YOU KNOW IM RIGHT,       KILL A POLITCIAL OPP,   HE WASNT TALKING ABOUT BIDEN, SEAL TEAM 6 IS HITTING THAT JUDGE.  IF HE WINS, AND THE PROCS",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@mangographics225",
            "commenter_channel_id": "UC3CLRrimiQq-oQ2kpj0qkEg",
            "comment_text": "Be Brave Brian!!  Be honorable and Do the Right thing!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@JPeck-kr8km",
            "commenter_channel_id": "UCGZ6XoO3Gq0RR1OtJmURp2g",
            "comment_text": "Butler may have been spooked. Now he's known, he may feel safer. \n\nWhat else has happened recently?  Mitch \nMcConnell has announced he's retiring, after his sis.in law Angela Chao drowned and may have had her car hacked",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@bentontramell",
            "commenter_channel_id": "UCPVmYkpB1l4Vo-onRxSx8rQ",
            "comment_text": "Where are the NJ boxes?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@MrGeoforce",
            "commenter_channel_id": "UCZj1sXNxlZntWGBH_ReoUFA",
            "comment_text": "How many Democrat politicians does it take to change a lightbulb?  The lightbulb is white invented by a white man. It’s racist! Call the FBI!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@touncy1533",
            "commenter_channel_id": "UC8r_VqxpWhMNhuYo_ltTTYQ",
            "comment_text": "tell that guy is a people pleaser... just the type for a trump to take advantage of",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-cs8zc6gf6t",
            "commenter_channel_id": "UCCCRCIY90xi2ZjVO67awpig",
            "comment_text": "BINGO!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@patricialkress7517",
            "commenter_channel_id": "UCkuNU37d9GCAPuUfz6_RN9w",
            "comment_text": "I bet he will not on fox",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-ud7sv2ld9u",
            "commenter_channel_id": "UC5r65o_disQyJLZqLd_7ZDA",
            "comment_text": "If he gets more than 5 votes I would be surprised",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@timp3035",
            "commenter_channel_id": "UCZ0xOyKcdrJRw1da7y1PAHw",
            "comment_text": "Remember when Trump said Haiti was a S Hole and the Left went Nuts, Some even went over there to prove He was wrong, Well hows that working out???",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Diatonic5th",
            "commenter_channel_id": "UCDS_pSMalGmXG0buTSaljjg",
            "comment_text": "Violent MAGA cultists will try to attack this man.",
            "likes_count": 1,
            "replies": [
                {
                    "commenter_display_name": "@martindread6530",
                    "commenter_channel_id": "UCZgnLLUgnaN5gdlFGXVOUSg",
                    "comment_text": "Too dumb and childish.. grow up.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@macaronisalad5",
            "commenter_channel_id": "UCabae30sDHbx4SoGfkoPYGw",
            "comment_text": "This is why Trump still every now and then to this day says they are his documents and he's entitled to those documents because he took them and he knows other people know he  took them. And he knew it was coming out someday for sure.And going to be confirmed that he took those documents and hid them from the fBI and took them to new jersey😅",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Transgender-GirL",
            "commenter_channel_id": "UC269Cu8nWRvNuk_ngjcvFMw",
            "comment_text": "😂😂😂🌟🔴🌟n so then its is \"TRUE\" thatn dickTaTor🕵 Maddman😡 TyranT🐍 presidemT donald j TRUMP🐘🇺🇸 issa, \"UNFiT\" fur aLL forms of Leaderwrship inna America🇺🇸",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@bethhiggins1907",
            "commenter_channel_id": "UCm-cKlKp7gSSmVBjPuXUUNg",
            "comment_text": "Hey play the clip of Don Lemon talking about how Fox is making a big deal about crime in NYC and then report on how the National Guard has to patrol the subway. You are the biggest liars on air.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@lopezb",
            "commenter_channel_id": "UCFngYR_geswcAeL7pBzyHwQ",
            "comment_text": "Anybody who takes a free lawyer from Trump is in big trouble, as they are only working for Trump's personal interests.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@michaelhenault1444",
            "commenter_channel_id": "UCZs6B-aTogtyTrBE23jiIMA",
            "comment_text": "Why not Bedmimster search?\n\nSherlock?\n\nOr maybe 🤔 there was!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ericrogal995",
            "commenter_channel_id": "UCwYJwajPb5tbNA2MK363Hxw",
            "comment_text": "Fake News! Man, you people are really disillusioned!!?? It just blows me away!! How you people think this way??!!\n  He was pres for four years and most people did not have a problem except the media because they knew he was calling them out. \nGet a hold of ya’ll selves , sheesh 🙄!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jackybrown5211",
            "commenter_channel_id": "UCQ-3eTI5JkK9zNO0WGs-SgQ",
            "comment_text": "Pumpkin 45 has top secrets documents all over hid places",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@fletcherchristian2254",
            "commenter_channel_id": "UCXz4-K1_IPESJyx9fQ5Weug",
            "comment_text": "The Presidential Records Act is the clearest example of just how much Trump despises his own cult.    He is so sure that they are too damn dumb and sheeple like to read it for themselves....and he is right!\nThe PRA makes clear that, upon the conclusion of the President’s term in office, NARA assumes responsibility for the custody, control, preservation of, and access to the records of a President. 44 U.S.C. 2203(g)(1). The PRA makes the legal status of Presidential records clear and unambiguous, providing that the United States reserves and retains “complete ownership, possession, and control of Presidential records.” 44 U.S.C. 2202.\r\nThe PRA also requires that all documentary materials “be categorized as Presidential records or personal records upon their creation or receipt and be filed separately.” 44 U.S.C. 2203(b). The President does not have discretion to categorize a Presidential record as a personal record.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tinarossie7443",
            "commenter_channel_id": "UCQ8m0iGt6vZxEXeqx4p6yLA",
            "comment_text": "it's crumbling for daddy",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@stephanegosselin2861",
            "commenter_channel_id": "UCvnwfN8v5rIY7nkQcYVgPKg",
            "comment_text": "At one point I thought that employee # 5 was Eric (😉) but hold and behold employee # 5 was an underpaid employee like all Trump’s employees who saw Donnie the diaper king breaking the law and the constitution. \n\nLock Trump up \n\nVote Blue \nVote Biden",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@BoloChingon",
            "commenter_channel_id": "UCI5wNoNGtYb7_4bFmYiop7w",
            "comment_text": "Trump one step closer in joining The J6 Choir Boys. 🙏🇺🇲",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tyler7790",
            "commenter_channel_id": "UCLSBx_gp51mUWsNlQF6ww7w",
            "comment_text": "🇺🇸🇺🇸🇺🇸maga 2024!!!!🇺🇸🇺🇸🇺🇸",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@ejwright5655",
            "commenter_channel_id": "UCdfbpVZFgI0pBkPCngen6-w",
            "comment_text": "The dominoes are all starting to shake and wobble!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@7hilladelphia",
            "commenter_channel_id": "UCDCCAmD2Z7Bo3OhoIiLp1bA",
            "comment_text": "New Fragrance  EMPLOYEE #5 ❤🎉🎉",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@LokiDaFerret",
            "commenter_channel_id": "UCvmMPhFvwxK10mSCbfsbJSQ",
            "comment_text": "Interesting but what value is  this info in court? He's going to testify that he moved boxes onto an aeroplane but he didn't know what's in them? Sounds incriminating but without knowing what's in those boxes, it seems like a nothing burger",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@richardjphilpott",
            "commenter_channel_id": "UCamGP4oDtI_5P84T2DY5Uvw",
            "comment_text": "I weouldn't trust this Gem witness as far as I could throw him...well coached by Dem. strategists. What a meat head ?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@georgemolato1532",
            "commenter_channel_id": "UCY40jDfpKmhO7GgaFK1G01g",
            "comment_text": "More corrupt people in the bag of the elitist. Nothing but propaganda here folks",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@dillardsshopper2486",
            "commenter_channel_id": "UCK9YcuDL2nWTEIF9Nu-EG2Q",
            "comment_text": "I wouldn’t put it past Trump to have placed some of those secret documents inside Ivana’s coffin.  He is capable of anything.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@richardjphilpott",
            "commenter_channel_id": "UCamGP4oDtI_5P84T2DY5Uvw",
            "comment_text": "FBI switched off internal cameras while they staged their photos. for CNN .Dems weaponised FBI rotten to the core !",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tomtroyer8185",
            "commenter_channel_id": "UCKMIwxT1JykYaBs9Ecznlvg",
            "comment_text": "F ing traitor…",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@williamdavidson1490",
            "commenter_channel_id": "UCRk11OH7z1c-qXuSJhvq3pg",
            "comment_text": "At 3:00 the \"Near by Business\" is Trumps storage lockers!! With more Classified Docs Hidden for Transportation !!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@twalrus1",
            "commenter_channel_id": "UCvLfoHr4sJae_9durlZQS-A",
            "comment_text": "Trump NEEDS about half a $billion dollars.\nTrump has top secret documents.\nGee, I wonder how he is going to come up with half a $billion dollars so fast?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@kahanakahuna1470",
            "commenter_channel_id": "UCis65cHFZVyUa1HEBxxVitA",
            "comment_text": "BREAKING:  FBI Director Christopher Wray on Monday warned of a \"wide array\" of dangerous threats coming from the U.S. border, including drug trafficking, violent gangs and smugglers with ties to ISIS.   (Thanks, Biden.)",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@doubleslit9513",
            "commenter_channel_id": "UCRHJihA0FlWRxA81hqPmduQ",
            "comment_text": "Worked for Trump for 20 years and probably got paid less than $65k/year.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@fletcherchristian2254",
            "commenter_channel_id": "UCXz4-K1_IPESJyx9fQ5Weug",
            "comment_text": "The PRA makes clear that, upon the conclusion of the President’s term in office, NARA assumes responsibility for the custody, control, preservation of, and access to the records of a President. 44 U.S.C. 2203(g)(1). \nThe PRA makes the legal status of Presidential records clear and unambiguous, providing that the United States reserves and retains “complete ownership, possession, and control of Presidential records.” 44 U.S.C. 2202.\nThe PRA also requires that all documentary materials “be categorized as Presidential records or personal records upon their creation or receipt and be filed separately.” 44 U.S.C. 2203(b). The President does not have discretion to categorize a Presidential record as a personal record.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@richardjphilpott",
            "commenter_channel_id": "UCamGP4oDtI_5P84T2DY5Uvw",
            "comment_text": "Dems keep pulling these rabbits out of hat ! Another Dem. stunt like Cassidy Atkinson's steering wheel yarn! Yuk Yuk !",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@bobbolan4672",
            "commenter_channel_id": "UCPCzcyRU0gQKoyqvq0XVXrA",
            "comment_text": "Guilty as sin itself. Vote Blue.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@hellbenderdesign",
            "commenter_channel_id": "UC2CpSipCRvZOMUrMtCGKcBQ",
            "comment_text": "Thank you for your honesty, gigantic talking human thumb.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@Transgender-GirL",
            "commenter_channel_id": "UC269Cu8nWRvNuk_ngjcvFMw",
            "comment_text": "😂😂😂🌟🔴🌟n so then its \"TRUE\" that dickTaToR🕵 Maddman😡 TyranT🐍 presidemT donald j TRUMP🐘🇺🇸 issa completely \"UNFiT\" fur all forms of \"Leadership\" inna America🇺🇸",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@peterbland7227",
            "commenter_channel_id": "UCdPdMCSbBtAiDarLNSVrTNQ",
            "comment_text": "How many lives will Trump ruin?",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@adamjarrell4968",
            "commenter_channel_id": "UCPaj9yBgTb81ti-FY4m4gnQ",
            "comment_text": "Lmao 😂 cnn trying everything for a view",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@keithwald5349",
            "commenter_channel_id": "UCuqEjpoAgJkUdFmk7sRZnAg",
            "comment_text": "Get this man protection, asap!",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@punchthem4582",
            "commenter_channel_id": "UCPa-HQx8CJXw3AowL0N1FOQ",
            "comment_text": "Holy crap!  Someone moved some boxes they must have been TOP SECRET!  Trump had hundreds of bankers boxes moved after leaving the white house... If only Trump stole his and kept them in the garage behind the vet like Biden does.  LOL",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tommydiaz3258",
            "commenter_channel_id": "UCwPpO2w6deLm35mZ2oROUug",
            "comment_text": "His valet guy! Oh wow this will be the straw that breaks him….Lol give it upppppp CNN. You Zionist supporters sound silly",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@roseromans8497",
            "commenter_channel_id": "UCLNVwz6TXQ4n0Z2zaeNBRZg",
            "comment_text": "I hope Bedminster is searched if it hasnt been already.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jaygibson5057",
            "commenter_channel_id": "UCoT6vowpfEpzwUMS3Sd32vA",
            "comment_text": "Quick, Google  the Senator from Delaware Records Act.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tomjmdalton8855",
            "commenter_channel_id": "UCTdgRZ5XMrUdlmLHG3NfgwQ",
            "comment_text": "look in the casket",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jaari2544",
            "commenter_channel_id": "UCvGdvOEloMv7hKGt8BP-ljA",
            "comment_text": "No one is more guilty than Biden who mishandled classified documents for more than 6 years haphazardly with an addicted son around prostitutes",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@marthabelzie1386",
            "commenter_channel_id": "UC4x1JWa-sAa2OJ3pippU9nQ",
            "comment_text": "LET THE HAITIAN PEOPLE  DECIDE WHO SHOULD BE THEIR LEADER, NOT CARICOM",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@sarabeth8050",
            "commenter_channel_id": "UCG0-ArQ-7JPTzNW13Un0tuQ",
            "comment_text": "Mr. Butler has representation who are his side rather than the creature's. Thus, Mr. Butler knows it's in his interest to tell the truth. The truth requires that that the creature must be imprisoned for life or worse. Definitely worse. Much, much worse. That much is owed to this nation.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@dalestaley5637",
            "commenter_channel_id": "UCZWA3BIm3F6cU5BwsMhPb4g",
            "comment_text": "Why didn't the FBI get a search warrant for Bedminster?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@marthabelzie1386",
            "commenter_channel_id": "UC4x1JWa-sAa2OJ3pippU9nQ",
            "comment_text": "LET THE HAITIAN PEOPLE  DECIDE WHO SHOULD BE THEIR LEADER",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Suds76",
            "commenter_channel_id": "UC0xYbHrenfZQwVLpeEceRLw",
            "comment_text": "I Cannon is going to slow-walk this case so that it isn’t started by November, then I hope witnesses come forward and share some damning secrets.  Trump can still be tried in the court of public opinion.  He’s been using that court to his benefit for so many years, maybe it’s time he be brought before that court.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@marthabelzie1386",
            "commenter_channel_id": "UC4x1JWa-sAa2OJ3pippU9nQ",
            "comment_text": "The Haitian people will choose their own leader, NOT CARICOM",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@KevinGibson-xc9ug",
            "commenter_channel_id": "UCt7JscuXSlJDozL1tcL9zXA",
            "comment_text": "Supreme Court will still give TRUMP leniency",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tomjmdalton8855",
            "commenter_channel_id": "UCTdgRZ5XMrUdlmLHG3NfgwQ",
            "comment_text": "lump, stump, dump, trump",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@marthabelzie1386",
            "commenter_channel_id": "UC4x1JWa-sAa2OJ3pippU9nQ",
            "comment_text": "VIV GUY PHILIP",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@sharonmaclean8122",
            "commenter_channel_id": "UC57Jv7TmCvkwvZoYLJyML6Q",
            "comment_text": "My theroy is 45 as we know all through his presidency was ploting to over throw the country.  He lost the race for president so before he left he got these boxes ready ( or could have bedn dojng this before. ) we sedn the pic of him trying to air them out.  Theroy is\nIn the plan to over throw an as leader  he wanted these secret high confidential files to  have this info 1. To know what each country had \nIn way of militzry , guns and military equipment. 2. To hold as ranson  3. To sell to foreign countries.  He had this pkanned all along.\nVOTE  LUE, BLUE, BLUE, BLUE",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@msioug",
            "commenter_channel_id": "UCpnwYvDI0-is7NKRimvsjkw",
            "comment_text": "Can’t wait to hear the “Brian Butler, who? I never met him, don’t know who he is.  I take a lot of pictures with people because I’m so famous.” line of 💩",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@bobbear4437",
            "commenter_channel_id": "UC8XzE8xuOGuAx3cy8QWggRw",
            "comment_text": "Trump lied about having these secret documents, \nthen tried to hide these secret documents!\nPut this criminal in prison!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@marthabelzie1386",
            "commenter_channel_id": "UC4x1JWa-sAa2OJ3pippU9nQ",
            "comment_text": "The Haitian people have made their choice,GUY PHILIP.  LET IT BE PLEASE!!!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@surewhatever8843",
            "commenter_channel_id": "UCukyIgI1IwcqMirvCtXYzMg",
            "comment_text": "Did donnie know Butler’s mom? The barely-chin, the small mouth...",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@RonGreene-sm4tk",
            "commenter_channel_id": "UC-Cz2Zo76Cnc2nqSiub-TrQ",
            "comment_text": "Why would employee #5 be speaking publicly if this is an on going case. Jack smith needs him as a witness when this goes to court.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@marthabelzie1386",
            "commenter_channel_id": "UC4x1JWa-sAa2OJ3pippU9nQ",
            "comment_text": "LET THE HAITIAN PEOPLE  DECIDE WHO SHOULD BE THEIR LEADER",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@deborahwalker7406",
            "commenter_channel_id": "UCOxzvjc5y9QYQLUbWx8MooQ",
            "comment_text": "I recommend intermediate fasting to  prepare for anyone headed for prison for Donald t-Rump. Waltine, I'm talking to you.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-jw3ug9uv5d",
            "commenter_channel_id": "UC2fZrmM9APsxw4tk1JRI5qw",
            "comment_text": "Vote for Biden for Mexico",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@koffyalert1768",
            "commenter_channel_id": "UCOFZ7dtomngm2fxFc9C-9iw",
            "comment_text": "CNN a wing of the Democratic Party",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Mclem2k24",
            "commenter_channel_id": "UCaBtMpAEqZoBOOE0CdMnJpw",
            "comment_text": "There's never a wrong time to do the right thing...as many in chump world are figuring out Hey, isn't it past chump's jail time?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tombuilder1475",
            "commenter_channel_id": "UCAYIwLNpy4oaJzqV9G3Y9QA",
            "comment_text": "10 banker boxes full of top secret documents! wow that is like 100 times more stuff than any spy have been cause with.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jaygibson5057",
            "commenter_channel_id": "UCoT6vowpfEpzwUMS3Sd32vA",
            "comment_text": "THIS\nthings aint going well for Hunter or Willis.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@GlennMiller-qv9tx",
            "commenter_channel_id": "UCaZTTqAKX0lRru3bUlJms-A",
            "comment_text": "Trump's long-term 20-year Butler looks like Brian Stelter's twin Brother 'Employee #5' is telling the truth.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Shogun86",
            "commenter_channel_id": "UCBeg_Hedc5j3WUK88pbSLZA",
            "comment_text": "This is all very interesting. Why didn’t CNN go into this level of depth as it relates to President Biden’s handlings of classified documents and his families business dealings with foreign governments to enrich themselves? Just wondering.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@koffyalert1768",
            "commenter_channel_id": "UCOFZ7dtomngm2fxFc9C-9iw",
            "comment_text": "Two kinds of justice in America. Biden does the same thing by hiding and recklessly keeping secrets documents and he is not prosecuted.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@marybarragan7279",
            "commenter_channel_id": "UCt7J213_UZdrxcaXgI937gg",
            "comment_text": "Looks like the orange man is a hoarder on top of a criminal",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Ullumma",
            "commenter_channel_id": "UCKCeMyTzNNEk89uK1yd0N0A",
            "comment_text": "So. Sick. Of. Trump.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-ei2ge9pb2c",
            "commenter_channel_id": "UC3ogKqtzn8tm07H8DbWk3PA",
            "comment_text": "CNN Chronic News Network 💩",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-hp1gk4jj5e",
            "commenter_channel_id": "UCCQqgcQyleyNjgXAeywkNmQ",
            "comment_text": "We are watching the biggest movie of all time. It does not end well.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@CT-kv3bx",
            "commenter_channel_id": "UCd7DOV7m06CzTN0HA3olSvQ",
            "comment_text": "It’s all gold for these idiots.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Shawn_M",
            "commenter_channel_id": "UCGeNnPnSAWU1JnV_ixf77iA",
            "comment_text": "I wonder how much info has already been sold to the Russians or Saudis",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-jw3ug9uv5d",
            "commenter_channel_id": "UC2fZrmM9APsxw4tk1JRI5qw",
            "comment_text": "Trump for president Biden for a nursing home",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@obasiddrisu5651",
            "commenter_channel_id": "UC_IKmk2S5mQRbs3RPV7R8hA",
            "comment_text": "Fake News",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@mydrouno",
            "commenter_channel_id": "UCRwNuh0uXXkzeLpu-0PpDWw",
            "comment_text": "Just like with us poor people, when people get threatened with jail time, they turn 😁",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Tammy_4",
            "commenter_channel_id": "UCnQjmzfXrMAIQ_QMGM5SKaA",
            "comment_text": "Trump's a. regular mobster. Fbi coming in the front..they are moving the goods out the back loading the plane. No telling what he still has and what he's already sold.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@outtakontroll3334",
            "commenter_channel_id": "UCkrG5nAFRjnPYrtmeMkNZrA",
            "comment_text": "BUT HILLARY\"S EMAILS !!!!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@kevinleecaster2698",
            "commenter_channel_id": "UCZbrU7NKz10qRSpZg6iiSWA",
            "comment_text": "Did CNN ask him about threats on his life from Republicans?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@blainerueckwald",
            "commenter_channel_id": "UCTjVzhg9_ndVj7PM92B0ipQ",
            "comment_text": "Typical Trump employee, “He had no clue.”",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@user-hp1gk4jj5e",
                    "commenter_channel_id": "UCCQqgcQyleyNjgXAeywkNmQ",
                    "comment_text": "Then when a fire was built under my butt i could remember and see the division 😂😂😂😂😂😂",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@johnq8362",
            "commenter_channel_id": "UCls6_y3uRnFuD_Lm1yJOmxg",
            "comment_text": "😂BIDEN commits treason everyday and forced his daughter to shower with him and CNN says nothing. CNN is very sick. BIDEN is very sick. DEMACRATS as a whole are off their rocker",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "What plants would you recomment?",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@johnq8362",
                    "commenter_channel_id": "UCls6_y3uRnFuD_Lm1yJOmxg",
                    "comment_text": "@@peippopeeirthe one that smartens you up 🤡",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "@@johnq8362 good quality basic education does. Hoping everybody would be able to receive it some day.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@timothykozlowski2945",
            "commenter_channel_id": "UCqxS8jWpQgwsDwhnY4_g9NQ",
            "comment_text": "Interesting that nobody knows what was in those boxes",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jimsummers487",
            "commenter_channel_id": "UCFp9Q3YSHjMiQiDvoLSHiHA",
            "comment_text": "Patriot act data mining being used to locate traitors ?",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@user-hp1gk4jj5e",
                    "commenter_channel_id": "UCCQqgcQyleyNjgXAeywkNmQ",
                    "comment_text": "Locate???? They broadcast from Mara Lardo",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@giantpurplebrain",
            "commenter_channel_id": "UCcfkAnXz9bBCSycajM2TCLA",
            "comment_text": "Well done to this guy. But do we really need MORE evidence? there are already mountains of irrefutable, undeniable proof - including Trump's own words. As damning as this is - it was already totally damning. The only obstacle between Trump and a guilty verdict is Judge Cannon.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@simplmark22",
            "commenter_channel_id": "UCZ-kaICOWm7aqPu7RqMnZtg",
            "comment_text": "Why are you making this witness public.  Wtf is wrong with CNN?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@gino2634",
            "commenter_channel_id": "UCErtQea6dLNYvy6o7F2GoOA",
            "comment_text": "the supreme court will not rule on the issue until the election or a month before. so no trail",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@24greatreveal",
            "commenter_channel_id": "UC74TENqVrmviz62Yi651bzg",
            "comment_text": "CNN, you are EVIL. You damn know that Mar-A-Lago is the new White House and he had the right to have the files just like all other previous presidents. You are EVIL, CNN. Biden had files when he was VP, not even president which was ILLEGAL. You will have to face GOD but then again, you DO NOT BELIEVE IN GOD because you HATE PEOPLE SO MUCH. You're coming down with your lies. STOP brainwashing people with LIES, LIES, LIES... He had the FBI approved and they even asked him to add locks. STOP YOUR BS AND YOUR LIES, CNN. IYou are making your news... t's hard to even think that people are watching you. Sadly these people have been sedated by your FAKE NEWS and can't think for themselves. Hear these people talk.... HOW SAD!!!!! The White House is empty since Trump left and BIDEN IN HELL, right now. SHAME ON YOU!!!!!!!!!!!",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@user-hp1gk4jj5e",
                    "commenter_channel_id": "UCCQqgcQyleyNjgXAeywkNmQ",
                    "comment_text": "You need to sober up. Go outside and get some fresh air. It is hard to admit you have been swindled. Stop swigging orange kool-aid and stop putting words in God&#39;s mouth.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "Gods most precious gift to you is your brains. So the worst insult to god would be you not to use them.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@jasongrant1973",
            "commenter_channel_id": "UC9sE9iOBKGuPqHwMB-TCEmA",
            "comment_text": "Trump:  Butler did it.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@cynthialahti-wong1800",
            "commenter_channel_id": "UClZ7K-eM4ufT4mocB1ZHTgg",
            "comment_text": "So it’s ok to go after Trump, what about Biden!! They’ve found literally hundreds of mixes a of classified docs documents in his garage in an office building in his basement and NOTHING happens to him!!! Justice for Delis is nonexistent but everyone doesn’t dare spit on the sidewalk!! Pathetic!!",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "This reel is about trump messing up big time. Not biden.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@sideeye7958",
            "commenter_channel_id": "UC2QFNTApDsdFh04xeXN2cvA",
            "comment_text": "I need more butter for my popcorn 🍿!",
            "likes_count": 3,
            "replies": []
        },
        {
            "commenter_display_name": "@robertmurray23",
            "commenter_channel_id": "UCHQ4WfSMJOtVicsRpedbsGA",
            "comment_text": "This all pales in comparison to what Biden did with classified documents.  Was the information leveraged for big foreign payouts to the Biden shell companies?  He wasn't even president, but wasn't prosecuted because he is a senile old man with a failing memory.",
            "likes_count": 1,
            "replies": [
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "This reel is about trumps a little bigger mess up. Im sure theres one about bidens also.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@bobwelke3308",
            "commenter_channel_id": "UCl_mRZeD6IMSlXEvhJ7YUxA",
            "comment_text": "For literally years now, we have heard about witnesses and revelations that are almost-mortally damaging to Trump. We have seen testimony under oath, pictures and videos and his own words convicting him of widespread wrongdoing. Still, and yet, Alene Cannon and the Supreme Court abet his attempt to delay accountability until after the election when he, the fascist, will make it go away. Will our system hold? And will accountability apply to others as well?",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@derekleonidas7664",
            "commenter_channel_id": "UC-pv_YW2LcDIEEtdYOBqQKg",
            "comment_text": "I never met him, he might have brought coffee for me, he is a fraud, he is not there, he is not real, he is AI generated.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@dstarrii9784",
            "commenter_channel_id": "UC1rEIj0KRR9WH_dz3rkvNcg",
            "comment_text": "I'll agree with Trump on one thing our justice system is corrupt because if it wasn't he would already be in jail",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@andyschnider9841",
            "commenter_channel_id": "UCHqRkgaD8fUZWgqLFib2lmQ",
            "comment_text": "What a snoozer of a breaking story.  Just like Russia, Russia, Russia.  Give us a break.  Stupid.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@talk3194",
            "commenter_channel_id": "UCRVCVTtNANjyhPgUsjC9rkw",
            "comment_text": "TRUMP GAVE IRAN COMPLETE CONTROL OF THE MIDDLE EAST!!!!!! \nTrump made Putin and Xi happy campers! RUSSIA, IRAN and CHINA ARE THE NEW WORLD SUPER POWER!!!!!! \n\nTrump used BiBi and the Crown Prince as pawns. \n\nRussia, Iran and China now have complete control over the Middle East. Once they’re done with Ukraine, Taiwan and Israel they’re all moving in on EUROPE and the UNITED STATES!!!!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@BC-pu2uq",
            "commenter_channel_id": "UCRUyJTwLLjCnRLY5MS4qEbA",
            "comment_text": "Witch hunt / fake news 😂😂😂😂",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "Are you syrian?",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@jimsummers487",
            "commenter_channel_id": "UCFp9Q3YSHjMiQiDvoLSHiHA",
            "comment_text": "The Republican Party is paying trumps legal fees…… for treason",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@lkeslinke",
            "commenter_channel_id": "UC-Lc8btAkT7CpKVfh58qk4Q",
            "comment_text": "Lock Him Up!",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@stoopstified7376",
            "commenter_channel_id": "UCgLpXt_HDljK2Nf1JAiPZMQ",
            "comment_text": "Tump has the binder ☠️🙃🖤 snd its driving them crazy",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "..And putin happy.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@horrible1083",
            "commenter_channel_id": "UCp7GxIGarZUXHhGln1D8_LQ",
            "comment_text": "what kind of human being can survive 20 years of service to Trump?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@keathp2744",
            "commenter_channel_id": "UC5C2bT7sx76d6ZSht19KFyQ",
            "comment_text": "I wonder how many he had already turned over to Moscow and Saudi Arabia?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@brucejohnson7445",
            "commenter_channel_id": "UCVqywaCDoGJ8A4aAplaqxgQ",
            "comment_text": "Trump gets prosecuted for classified docs,  senile Biden walks.  Lawfare against Trump never stops.  I hope as President he goes after the left with extreme prejudice.  Use the Insurrection Act.",
            "likes_count": 1,
            "replies": [
                {
                    "commenter_display_name": "@peippopeeir",
                    "commenter_channel_id": "UC9_ufa_jyVuFpz-MOvJvxvA",
                    "comment_text": "The best way to be sour is never trying to get well educated. Years go so fast by.",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@sideeye7958",
            "commenter_channel_id": "UC2QFNTApDsdFh04xeXN2cvA",
            "comment_text": "Great witness better than the Republicans Russia asset against Hunter Biden",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@alicemcleod6149",
            "commenter_channel_id": "UC0iP0rKguqemfJUdcK37-rw",
            "comment_text": "Keep Employee #5 safe from TRUMP!!",
            "likes_count": 7,
            "replies": []
        },
        {
            "commenter_display_name": "@pattiwhite9575",
            "commenter_channel_id": "UCvcNg0rDlrmq2NWw8BvOiMw",
            "comment_text": "Hump is so darn dirty.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@hectorbolivar6266",
            "commenter_channel_id": "UCXEqxhed-RQgTTkOtQdgt4g",
            "comment_text": "How much more 💩 must we pile on top of the NY con man before Americans are convinced he is a no good shyster.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@robertmuckle2985",
            "commenter_channel_id": "UCGqVtKvcWRO5UnCnzCbEEMw",
            "comment_text": "Absolutely MIND BOGGLING...that tRump is walking around a free man, after jeopardizing the safety and security of the entire USA!!!🤯",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@mykelcsmith",
            "commenter_channel_id": "UC_COtl-cyj50IftDrFl5hTg",
            "comment_text": "About time",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@Vinnie-cv5qv",
            "commenter_channel_id": "UCw5sp4oVD9cqwqDO7PXn5pw",
            "comment_text": "Michael Cohen said to check where Trump traveled all those times and you will find documents. The FBI should have searched Bedminster NJ. I do not put it past him that he had some buried with Ivana where he buried her on his golf course.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jabbermocky4520",
            "commenter_channel_id": "UCNZe387vOwYXx5lTKhn0tMg",
            "comment_text": "What else is at Bedminster?  A giant box buried on the first hole, that's what.  I wonder what's in that massive casket?   You could easily fit half a dozen banker boxes in there AND a small container of human ashes. Ivana was cremated. Why did it take 10 pall bearers to carry the giant coffin?  Paper is pretty heavy in bulk quantities, that's probably why.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@tonydagostino6158",
            "commenter_channel_id": "UCuxvw14xy4XJ3Fee6z3T94g",
            "comment_text": "What's really buried in Ivanka's \"grave\" at Bedminster?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@exjolt",
            "commenter_channel_id": "UCKEd0pCx11u9iXArENDubOQ",
            "comment_text": "Lavendar is definitely her color 👍🏾",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@kevinclarke5804",
            "commenter_channel_id": "UCFJIHEF_qHPYTpQlXUnXEtw",
            "comment_text": "One term failed president…",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@kevinreid8946",
            "commenter_channel_id": "UCMD4V4p2TG76-iAz8n9-ATQ",
            "comment_text": "CYA!!! That's what he's doing. This man does not want to go to jail.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@HBTT_hauntedbythetruth",
            "commenter_channel_id": "UCz08-6VcgBNmKJrmTIT9X6A",
            "comment_text": "The truth shall set him \n\n\n\n\n\n\n\n\n\n\n\nup for prison!! \n\nBuahahahahahahahahahahahahahahahahaha",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@lindalb9519",
            "commenter_channel_id": "UCYbfKvDUAHNPsRH_66risXg",
            "comment_text": "It never dawned on him he was moving government classified documents by the sit load - because, it's like - who could be THAT stupid??",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@HJG514",
            "commenter_channel_id": "UC8kzOV7lW2QUhD4l3G2GzNA",
            "comment_text": "Wow as a average employee in government I can't understand how the orange clown doesn't respect sensitive or classified information. It's baffling how ignorant and incompetent he is. Glad employee #5 is speaking out, people please speak out abount the illigal or improper behavious the clown takes. SAVE DEMOCRACY!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@hectorbolivar6266",
            "commenter_channel_id": "UCXEqxhed-RQgTTkOtQdgt4g",
            "comment_text": "There is no friendship among criminals.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@michaeljohnston272",
            "commenter_channel_id": "UC_XCRkgzxijtMGduJMyUKYg",
            "comment_text": "This guy has a hard time coming",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@RebaCampbell1984",
            "commenter_channel_id": "UC49V3I616J4joPRF4bD4b2w",
            "comment_text": "HOW in GODs Green Earth, does DoJ allow Trump to be free, when he's clearly has more info either in boxes or in his head, and Trump's meeting with Putin's friends like Victor Orban, PM of Hungary, \n Orban easily could of taken info. back to Hungary, where he's turning Hungary back to a autocracy.  Get rid of Cannon, and get to the document  trial.  There's enough evidence, more is not needed.  Cannon needs to recluse herself, clearly she is delaying the trial.  She is unable to do her duties.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@saltireeire5775",
            "commenter_channel_id": "UCPPyl0o8yqQnLgQafweMjYw",
            "comment_text": "You’re going to jail Donny boy",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Souljoka",
            "commenter_channel_id": "UCedoOazmFuplJL0NupFIZIw",
            "comment_text": "Looks like Trump , moves like Trump must be Trump 🤔",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@deloresosborne2818",
            "commenter_channel_id": "UCtXBF0wOGE4Faa86lOO_nmw",
            "comment_text": "Benedict Donald!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@hectorbolivar6266",
            "commenter_channel_id": "UCXEqxhed-RQgTTkOtQdgt4g",
            "comment_text": "Screw Oliveira.  He wants to be a traitor too, he needs to go to prison",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jimsummers487",
            "commenter_channel_id": "UCFp9Q3YSHjMiQiDvoLSHiHA",
            "comment_text": "I always wondered what T.S. Stood for…..\nNow I know it means Trumps Stuff",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jeffreyweston900",
            "commenter_channel_id": "UClkW5neWkSCBT3MJxG6bmqw",
            "comment_text": "How soon before Trump says he was nothing more than a coffee boy lol",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@PeterPettigrew-jl7gf",
            "commenter_channel_id": "UCOizVFjG-fGVy2fkELWpmCw",
            "comment_text": "All the Attorneys who certified he had no documents should be disbarred and prosecuted!!  They all swear oaths to be held to a higher standard.   What a bunch of BS!!!",
            "likes_count": 5,
            "replies": [
                {
                    "commenter_display_name": "@giantpurplebrain",
                    "commenter_channel_id": "UCcfkAnXz9bBCSycajM2TCLA",
                    "comment_text": "They might have a genuine defense - Trump had lied to them - as far as they knew they could have been telling the truth. A tangled web. Making Attorneys Get Attorneys indeed.+",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@coldisle",
            "commenter_channel_id": "UCY2nIbdd3yGbxVYmmEpNIlA",
            "comment_text": "He seems like a very decent credible guy who actually has respect for the law. He is also a brave man in rejecting the Trump lawyers and trying to do the right thing by simply being honest…..a term foreign to his former boss.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@nightrider9904",
            "commenter_channel_id": "UCKYxSP2sacxLSi1QNgtUo5Q",
            "comment_text": "Why have they not searched his plane and Bedminster?",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@Transgender-GirL",
            "commenter_channel_id": "UC269Cu8nWRvNuk_ngjcvFMw",
            "comment_text": "😂😂😂🌟🔴🌟presidemT ...\n...donald j TRUMP🐘🇺🇸 ....you still could bee... an \"FELON\"🕵.. CrimnaL.🏛. ...we jus don relly know yeT... inna America🇺🇸",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Unionjoint",
            "commenter_channel_id": "UCho6KFkfQxaTI_2vl48wzQw",
            "comment_text": "It makes sense why now he filed a motion of presidential immunity in NY.  Not that he did anything wrong of course, lying to his own lawyers and FBI, moving government documents secretly.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@akmpolsen",
            "commenter_channel_id": "UC3wZwm9CRBPeXfutNOFxylA",
            "comment_text": "Can't wait for Trump's response...",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@cashaeleatemla",
            "commenter_channel_id": "UCht1jH3Kf6RPM9dFyiVTFJw",
            "comment_text": "The few seconds capture the dynamic between the two men that persisted even into the early days of the documents investigation: Butler as protective of his buddy, and as the supervisor in Trump’s universe whom Trump’s aides often reached out to first.\r\n\r\nButler told CNN on Monday that De Oliveira was known to have a good relationship with Trump.\r\n\r\nThe conversation echoes one prosecutors picked up on years later which now forms the very last allegation in the indictment. In August 2022, while Butler and De Oliveira enjoyed a long weekend with family at a Florida casino for Butler to celebrate his 40th birthday, Nauta reached out to Butler “to make sure Carlos is good,” prosecutors allege.\r\n\r\nButler assured Nauta twice that De Oliveira was loyal and wouldn’t do anything to hurt his relationship with Trump.\r\n\r\nProsecutors say Trump then called De Oliveira to tell him he would get his property manager a lawyer.\r\n\r\nButler and De Oliveira were at the casino’s food court when that call came in, Butler recalls. De Oliveira hung up the phone, happily, and told Butler that Trump would provide him an attorney, Butler says.\n\nButler recounted the story to prosecutors and provided them access to his two cell phones.\r\n\r\nSince the Trump indictment, Butler has seen De Oliveira from afar in their neighborhood, and in news clips as his friend comes and goes from a federal courtroom.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@beefree5215",
            "commenter_channel_id": "UCB-E7le4rWSJKHbF4vqC0Gg",
            "comment_text": "Just more garbage propaganda 😆🤣😂.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@niclewis9610",
            "commenter_channel_id": "UCWCzB6NxSqKU7j7nMjxxTlA",
            "comment_text": "If Trump keeps being treated like a protected species by the Justice system what's the point? Justice delayed is Justice denied. We the people want a Trial.",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@kissmyaxe531",
                    "commenter_channel_id": "UCWQrEw8zD08FAzFfE1flBEg",
                    "comment_text": "It’s almost as if you’re complaining about the liberal judges and liberal prosecutors appointed by the democrat party that you voted for lol.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@niclewis9610",
                    "commenter_channel_id": "UCWCzB6NxSqKU7j7nMjxxTlA",
                    "comment_text": "@@kissmyaxe531 Yes because it&#39;s not like Republicans have Appointed more. Assumptions mother of all Fk ups",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@kissmyaxe531",
                    "commenter_channel_id": "UCWQrEw8zD08FAzFfE1flBEg",
                    "comment_text": "@@niclewis9610 what part are you struggling with bud ? Is there a prosecutor involved in any case that is a trump supporter? You’re not this dim right? lol",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@8088I",
            "commenter_channel_id": "UCwlcECcKOskrIQx1It954wg",
            "comment_text": "Collins finally redeems herself from her \npreviously 🍑🤡🎩 enabling interview. 👍",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@jcsinca3387",
            "commenter_channel_id": "UC95pWPw4fZb4y68FUzphIeQ",
            "comment_text": "I'm wondering how come news agencies like CNN or FOX are NOT asking Congress and the White House what their Security people actually do there. How can 3 Presidents walk out of there with classified and just hand it out? How is that even possible - MULTIPLE Times? How could they possibly have a functioning security office if idiotic civilians are allowed to just WALK OUT of SECURED AREAS with boxes of classified?\nYou can ask ANYONE that has a SECRET for Top Secret clearance and they will easily tell you that they must have an initial briefing where they sign a statement saying they will NEVER do those things. Then they have ANNUAL training on it EVERY YEAR. And then the security office actually does periodic inspections to ensure standards and procedures are being maintained. \nAnd yet for some reason at OUR NATIONS CAPITAL an orange civilian draft dodging moron was allowed to leave the Capital with BOXES of Top Secret data and just hand it out and sell it to anyone and that was years AFTER Hillary was an idiot with some lower level classified data. And after these 2 idiots have a turn being complete imbeciles then Biden takes his turn does it with lower level intel. \nIf any of the people I work with did anything WAY LESS to the stupidity that these 3 people did they would be FIRED and have their security classification rightfully REVOKED! \nWTF is going on at the Capital? IS THERE NO SECURITY OFFICE THERE? ARE THERE NO SECURITY PROCEDURES, NO POLICY, NO OVERSIGHT? \nDo we let every MORON in congress run around handing out Americas classified information and the classified info of our ALLIES? \nWHI ISN\"T THE NEWS REPORTING ON THAT MAJOR GOVERNMENT FAILURE?\nNow you combine that stupidity with the fact that on Jan 6 these same security rocket scientists allowed a mob of domestic terrorists (idiots actually, Trumpanzees and fools) to OVERRUN the Capital secured areas and steal peoples laptops and threaten the safety of all the decent people that work there. People DIED! \nWTF IS GOING ON WITH THIS COUNTRY THAT THIS CONTINUES TO OCCUR UNCHECKED AND GETTING WORSE? \nCapital security is obviously WORTHLESS and they all deserve to be FIRED immediately and the use of deadly force needs to be authorized and implemented to stop future occurrences.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Adam-wn6pm",
            "commenter_channel_id": "UCRTiNcN_M87cpxsorZHwfow",
            "comment_text": "I’m not sure about this guy… info seems too good to be true and seeing him ham it up on camera in that color suit and THAT damn tie?? I’ll tip my hat if and when he testifies at trial",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@glum75",
            "commenter_channel_id": "UCoUIIrbRJ9VIHlf0J2okXNA",
            "comment_text": "Lots of people are saying Judge cannon is trying to publicize this guys home address to be “transparent”.  We all know trump is signaling to cannon to try to get rid of this guy.  She and trump are going to get this guy killed.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@GumbysClay53",
            "commenter_channel_id": "UC_efMP2FlrdwaH4kUhnsIdw",
            "comment_text": "The continued tolerance of Cannon's behavior is as bad as tolerance for Trump's treason. Get her the f*ck off that case...we all knew she would do just what she's doing now.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@dangroat4438",
            "commenter_channel_id": "UCCT7W97gdxKnJiQ3sxh6Uog",
            "comment_text": "If all of this is true, then Trump is surely guilty of trying to conceal and hide the fact that he had classified documents. If I was on a jury I would have to find him guilty of this count.",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@kissmyaxe531",
                    "commenter_channel_id": "UCWQrEw8zD08FAzFfE1flBEg",
                    "comment_text": "lol 🤦‍♂️",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@ImmuneToTrollHate",
            "commenter_channel_id": "UCOtQowxu29_WKX-rUKY4jBw",
            "comment_text": "This guy is smart\nAccepting an offer from Trump to pay for your lawyer is a a one way street to going to prison for Trump\nEmployee 5 meet bus, Trump wants you under it",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-ii7ny1zl8t",
            "commenter_channel_id": "UC1B5J368uLipgvy_gjHRmFw",
            "comment_text": "Wait is this my retirment i just fpund.or another theft. Federal abuse. Like indian sttlements i had rights. My ssn my bd. My name spelled differenrtbyt look email and phone number different but dont have rights to them",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-ki6re5if7o",
            "commenter_channel_id": "UCh9XeX-Qvy7PmvMnEdHHQJw",
            "comment_text": "Trump is so dangerous he would sell out his own country thats treason??",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@kissmyaxe531",
                    "commenter_channel_id": "UCWQrEw8zD08FAzFfE1flBEg",
                    "comment_text": "Isn’t that precisely what Biden did ? lol",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@Trumpstinks",
            "commenter_channel_id": "UCMbAZCHtKVVkFKQUVA1rs-g",
            "comment_text": "No one on the right will ever hear about this.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@anitaevans5361",
            "commenter_channel_id": "UCWwvkJ7L--83XD-WTzl1zQw",
            "comment_text": "#WHERESMELANIA",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@davidki2439",
            "commenter_channel_id": "UCewC4jrNuOxqPYgVg6zfJdQ",
            "comment_text": "More CNN Lies",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@sfl6307",
            "commenter_channel_id": "UC52bodhD1hI3f1LGwW8ftvg",
            "comment_text": "FACT that CHUB SECURITY is helping a criminal like Trump I will not use their home security system.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@debracarlson5511",
            "commenter_channel_id": "UCYBmXtrwk-9LejyV4U0492A",
            "comment_text": "Sadly, Republican Federal Judge Cannon will make sure this Trump case will never go to trial. SAVE DEMOCRACY VOTE BLUE 💙",
            "likes_count": 4,
            "replies": []
        },
        {
            "commenter_display_name": "@danjohnson6800",
            "commenter_channel_id": "UCJ2ADFXRyImfaj5ZYAU3MSw",
            "comment_text": "Where did those documents go? Boxes of documents leaving Mara Lago on an airplane—where did they go? We’re these taken to Bedminster or somewhere else?\n\nImagine offering someone free golf if they would go along with taking classified government defense secrets to some unspecified location for unspecified purpose.\n\nIt’s worth trillions, so I would definitely only settle for billion, I mean, if your going to go along and get ensnared in a national defense criminal case, you’re going to need the money, and free golf isn’t going to cut it. Good ole trump, always playing the public for suckers!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@giantpurplebrain",
            "commenter_channel_id": "UCcfkAnXz9bBCSycajM2TCLA",
            "comment_text": "I appreciate him coming forward - but why is he wearing a Trump costume? and does it come complete with man-diaper?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@JeffKing-gt1kb",
            "commenter_channel_id": "UCOvFkTK0I371xo5gkCzo9-A",
            "comment_text": "The number of boxes would have filled an entire semi-truck.  The multitude of boxes is staggering.  There is no bigger idiot than Trump.  Put the guy in jail with Bubba as his cell mate.",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@kissmyaxe531",
                    "commenter_channel_id": "UCWQrEw8zD08FAzFfE1flBEg",
                    "comment_text": "The guy you voted for stored them in his garage where his addict son had access who also happened to be doing corrupt business overseas. Who on earth are you labeling an idiot lol. 🤪👈",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@ericpowers6509",
            "commenter_channel_id": "UC0LXVDyZgjqUmAp2NY_bvhA",
            "comment_text": "In other words,  he's a good employee. He didn't snoop. Never opened a box.",
            "likes_count": 4,
            "replies": []
        },
        {
            "commenter_display_name": "@Johnnyo1000315",
            "commenter_channel_id": "UC-4-6H485-aCYX3UOrU3aNg",
            "comment_text": "Garland really botched this by taking so long he knew Trumps delay play book ..",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@dougdiplacido2406",
            "commenter_channel_id": "UCULu4Bvzm8iIWgFW6wJ4Y5w",
            "comment_text": "Now this guy has to worry about one of the magas doing harm to him.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@spindriftbeach6082",
            "commenter_channel_id": "UCY2Ha29pER68A9xChm-4sdg",
            "comment_text": "Big problem is he did not know what was in those boxes. I really hope he's got more direct evidence than that.",
            "likes_count": 1,
            "replies": [
                {
                    "commenter_display_name": "@canadiangemstones7636",
                    "commenter_channel_id": "UCZnVLsE2ESc0gPAU8kz4RpA",
                    "comment_text": "They. Have. Video. 😂😂😂",
                    "likes_count": 1
                }
            ]
        },
        {
            "commenter_display_name": "@cheeseheadfiddle",
            "commenter_channel_id": "UC1cvSdtn-jSaxjpAcVhl_2w",
            "comment_text": "Dude seems to have a conscience.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@rodge4176",
            "commenter_channel_id": "UCZiX5bekGLgGcrqFgAZjNlQ",
            "comment_text": "The bathroom seems to be used, from whom and how often is one of many questions. I like to read while using but never had a chance to read such interesting stuff🎉",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@CSmith-oz4wp",
            "commenter_channel_id": "UCrxuC-Qb-3i6R6XAelianWQ",
            "comment_text": "How much more evidence do we, the American people need to bring these whole Trump charges to trial ?",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@psarmijo5256",
            "commenter_channel_id": "UCJ1cBBiZVa1qYKEIzo5nODA",
            "comment_text": "Nothing matters when judge cannon kicks it down the line to delay.. JUSTICE delayed is justice denied.",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@willl1358",
            "commenter_channel_id": "UCVChOwHIE9lbgHN0oRzld6w",
            "comment_text": "He worked for him for 20 yrs but Trumputin oops Trump will say \"HE NEVER MET OR KNEW HIM\" 🤭🤣🤣🤣 LOCK HIS A$$ UP ALREADY WTF \n🇺🇲⚖️👮🏾‍♂️🚓🚔🇺🇲👍🏾",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@Johnnyo1000315",
            "commenter_channel_id": "UC-4-6H485-aCYX3UOrU3aNg",
            "comment_text": "Hopefully this gets to trial before the election,  we have such a broken two tier justice system it’s laughable, \nAny of us would of never seen the light of day again … 😢",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@matthewmay6850",
            "commenter_channel_id": "UCtvfLCM5j2l_3HifSjSeJSg",
            "comment_text": "Enough already Trumps a clear and present danger to our country. Just lock him up on the documents case at least, no bail? Nothing? And he's meeting in secret with Viktor Orban at the scene of the crime? 10\" binder still missing? ENOUGH!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@LeneCharlottePoems",
            "commenter_channel_id": "UCmdukc4jofVkDik21Rt2vzQ",
            "comment_text": "Thank you CNN \nOn time 🙏🎤🗽⚖️🇺🇸👏👏",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@SybilSpotter",
            "commenter_channel_id": "UCKnU-wOy9EeFU0_VJeYQ6jg",
            "comment_text": "The red hatters have less and less to say, eh, Sybil!?😂",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@amartin8994",
            "commenter_channel_id": "UCDK51TqyIFkj58V26faKbjg",
            "comment_text": "It’s only one way out of this mess, and that is to vote every Republican out of office November 5, 2024. And then send Trump to a nursing home.!💙💙",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jamesrideout123",
            "commenter_channel_id": "UCWlPQa8Wz1ZgFupcwv31sig",
            "comment_text": "The guy in thsi video os depressed cause he knows its bullcrap",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-wb3es8hz1d",
            "commenter_channel_id": "UCY9sVMtx6raBfQoEKAbOM5Q",
            "comment_text": "As long as Trump tries to delay his cases, the more the investigations can continue and more evidence can be gathered and more witnesses can come forward to give their testimony under oath.  There is a silver lining for prosecutors.  The more witnesses who come forward, the more useful details emerge and the better the case!  Use this time very wisely.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jim2376",
            "commenter_channel_id": "UCJy-Qjvy2AKzP9n57ToQBJw",
            "comment_text": "Butler will soon be receiving death threats.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@MrDanMeman",
            "commenter_channel_id": "UCXKWhEowVi7xITeFQGujAdQ",
            "comment_text": "Trump will say he never met him lol",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Cachas113",
            "commenter_channel_id": "UCbuJbj5J3dmCZnuHk9NGW0A",
            "comment_text": "Let me find out employee number 5 is actually Trump without his wig",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@toneyingram732",
            "commenter_channel_id": "UCpysO_m-_eY9TK7J7LseMng",
            "comment_text": "Some people.    say I'm wrong but Trump was sent from Satan how many families don't talk to each other and this  never happen in the history of the country after him people hate each other",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-wb3es8hz1d",
            "commenter_channel_id": "UCY9sVMtx6raBfQoEKAbOM5Q",
            "comment_text": "Excellent evidence!  This is one successful approach for prosecutors to utilize:  release selective evidence.  Let the VOTERS view it now.  While there are delays, etc., the prosecutors can choose to show certain evidence.  No harm, no foul.  It is an effective way to use this valuable time.  Vote Democrat!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@HUFFLE-PUFF",
            "commenter_channel_id": "UCCmxwv3iO-OTmmuJ1utL13w",
            "comment_text": "Trump wears makeup and we’re supposed to think he’s STRONG 💪🏻. It’s absolutely laughable! He’s weak physically and most importantly, mentally!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Transgender-GirL",
            "commenter_channel_id": "UC269Cu8nWRvNuk_ngjcvFMw",
            "comment_text": "😂😂😂😂🌟🔴🌟presidemT...\n... donald j TRUMP 🐘🇺🇸... we know you like... us \"EaTing BuGs\"...🐜🐜🐜🕷🕷🕷🍔 ...inna America...🇺🇸",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@SA-bg6kr",
            "commenter_channel_id": "UCYtDXGRTlhROwm2_bdG4OPA",
            "comment_text": "The dishonesty of this news channel is beyond the pale. The gentleman never looked inside the boxes as he confirmed. They could have been boxes of porn ffs..\nThats why theyre saying \"after a long think. He put 2 and 2 together. Those boxes. Must have been top secret documents.\" After never confirming this was the case.\nIdgaf who wins Americas election, its an open asylum.\nIm surprised the open border hasnt forced the mexican government to do more and keep Americans out.",
            "likes_count": 0,
            "replies": [
                {
                    "commenter_display_name": "@kensmith5694",
                    "commenter_channel_id": "UCAMNUB4d_oPVJytmtUH3nzw",
                    "comment_text": "This report was honest.  At no point did they claim he knew what was in those boxes.  You are being dishonest in your reacti9n.",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@SA-bg6kr",
                    "commenter_channel_id": "UCYtDXGRTlhROwm2_bdG4OPA",
                    "comment_text": "5 minutes. Like a record..imagine if the real smart people wanted to play you 😂",
                    "likes_count": 0
                },
                {
                    "commenter_display_name": "@SA-bg6kr",
                    "commenter_channel_id": "UCYtDXGRTlhROwm2_bdG4OPA",
                    "comment_text": "Btw.... <a href=\"https://www.youtube.com/watch?v=PIWNVT-DQlc&amp;t=265\">4:25</a> 😂",
                    "likes_count": 0
                }
            ]
        },
        {
            "commenter_display_name": "@PericoDelgado88",
            "commenter_channel_id": "UCeX9SFoxnpL5IWWb53yd4ww",
            "comment_text": "American Justice: \" Another witness with  corroborated facts\"\r\nMaga: \"Whatty bout Hunter Biden's PenisPic.\"?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@4rodbey",
            "commenter_channel_id": "UC4oE-Xmx4050tRnyfz9-9Yg",
            "comment_text": "Im so shocked that this finally came out 3 plus yrs later...",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@lastboyscout629",
            "commenter_channel_id": "UCZAqlPX7GbElEnk1prRpSSw",
            "comment_text": "The FBI needs to search Trump's property in NJ for those 15 boxes of classified documents.  Then Jack Smith can indict Trump in NJ.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@mikeharper3459",
            "commenter_channel_id": "UC6gmm3ME3i48c1wlml5rRgA",
            "comment_text": "Love this dude’s tie situation, peaking out like the Mushroom’s mushroom!!!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ricinro",
            "commenter_channel_id": "UCYfKd8QX5Z6SY1bcV7gIFPQ",
            "comment_text": "number 5 is alive!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@rodicaionescu3024",
            "commenter_channel_id": "UCtDtH2mZsmWACX3_p7iTswA",
            "comment_text": "Marxism 😂😂😂😂",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-cd3tq9ye2p",
            "commenter_channel_id": "UCwlTocZqq4ZFUkPIglO96zA",
            "comment_text": "c,nn bs",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@davidbrisbane7206",
            "commenter_channel_id": "UCo9CdqodES0KQrWOwxAu6DA",
            "comment_text": "Employee #5 has just become MAGA target #1.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@habitant71",
            "commenter_channel_id": "UCC-Xu1urqQTqX4OWrNC_KLA",
            "comment_text": "And it gets crazier and crazier!! This is insane, it just goes to show how much of the country would prefer to be corrupt.",
            "likes_count": 4,
            "replies": []
        },
        {
            "commenter_display_name": "@toneyingram732",
            "commenter_channel_id": "UCpysO_m-_eY9TK7J7LseMng",
            "comment_text": "Gay in the closet Trump  wanted to hold on to Putin and Kim love letter",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jmcm8546",
            "commenter_channel_id": "UCB0mxgXBAGtageSYvtgxD_w",
            "comment_text": "Nauta is a silly boy, as he will lose his liberty for someone who doesn't care about anyone. His only hope is trump gets back into power.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@andykosec",
            "commenter_channel_id": "UCab5hjPc7nZhkn_r3axMGWA",
            "comment_text": "Kaitlan's lipstick matches her blazer. Beautiful.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@13muller9",
            "commenter_channel_id": "UCaeYrJqEKJJF80KM0X9_b2Q",
            "comment_text": "Employee # 5 just became Five star witness !!!",
            "likes_count": 8,
            "replies": []
        },
        {
            "commenter_display_name": "@CretieBee",
            "commenter_channel_id": "UCLMgSriLRgPh2pqXq4xcdlw",
            "comment_text": "Meanwhile trump’s attorneys hasn’t won a case yet. And his minions thinks their going to walk free😂",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@nw9353",
            "commenter_channel_id": "UCjJC3wyc5ZooSBivud2mBDw",
            "comment_text": "If only the entire system was not protecting Trump.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jim2376",
            "commenter_channel_id": "UCJy-Qjvy2AKzP9n57ToQBJw",
            "comment_text": "What the hell is a \"body man\"? It's got a creepy . . . eww . . . connotation.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@wariv4512",
            "commenter_channel_id": "UCBjCQrZCz5G2VAian6qmkng",
            "comment_text": "Biden keep documents in the garage, it's worst than Trump",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@SH-sr5ol",
            "commenter_channel_id": "UCcSJsjZVzkK4ZNEOjKUK3fQ",
            "comment_text": "This guy is credible",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@cashaeleatemla",
            "commenter_channel_id": "UCht1jH3Kf6RPM9dFyiVTFJw",
            "comment_text": "A longtime Mar-a-Lago employee who is a central witness in the investigation into former President Donald Trump’s handling of classified documents is now speaking publicly because he believes that voters should hear the truth about his former boss and the case before the November election.\r\n\r\nBrian Butler, who is referenced as “Trump Employee 5” in the classified documents indictment brought by special counsel Jack Smith, told CNN in an exclusive interview that he doesn’t believe the criminal case against Trump is a “witch hunt,” as the former president has claimed.\r\n\r\nButler gave testimony to federal investigators that informed crucial portions of last year’s criminal obstruction charges against Trump and his two co-defendants, Walt Nauta, a personal aide to Trump, and Carlos De Oliveira, a property manager at Mar-a-Lago who had been Butler’s closest friend until recently.\n\nButler, who was employed at Mar-a-Lago for 20 years, has spoken repeatedly with investigators, paying for his own attorney and breaking with the orbit around Trump that he knows so well – setting him apart from his former colleagues and friends as his former boss has been named in multiple federal investigations.\r\n\r\nButler told CNN how he unknowingly helped Nauta deliver boxes of classified information from Mar-a-Lago to the former president’s plane in June 2022 – the same day that Trump and his attorney were meeting with the Justice Department at Mar-a-Lago about the classified documents.\r\n\r\nThat day, June 3, 2022, Butler received what he remembers as a strange request from Nauta, who wanted to know if he could borrow an Escalade from the car service Butler ran for Mar-a-Lago. Trump and his family were about to fly to New Jersey that day for the summer, and it was typically Butler and his valets who handled getting their luggage onto the plane.\r\n\r\nBut it was an unusual request from Nauta for the car, Butler says, because Nauta typically didn’t handle moving luggage and asked Butler for the car in a guarded way.\r\n\r\nButler says Nauta and De Oliveira loaded up the vehicle before driving it to the West Palm Beach airport. Butler arrived with his own car filled with Trump family luggage, then helped Nauta load Trump’s plane with the luggage – as well as bankers boxes of documents that were in the Escalade. Butler says he didn’t realize the bankers boxes contained anything out of the ordinary.\n\nThree months after the FBI removed hundreds of government records from Mar-a-Lago in August 2022, Butler left his job as a club valet and manager, in part due to a growing restlessness to move on.\r\n\r\nButler says he has considered for months going public about his role in the obstruction case against Trump as he has carefully followed developments in the criminal case. Butler says he decided to sit down with CNN exclusively in West Palm Beach on Monday out of a wish to tell the truth and share what he knows to those who may doubt the facts of the case.\n\nButler, who has not previously been named publicly, is referenced six times in the Justice Department’s indictment as “Trump Employee 5.” The references made to Butler in the indictment capture only an inkling of what he knows and could be asked to speak about on the witness stand — all of which he says he’s already shared with prosecutors, giving them a window into scenes where other witnesses may have been close-lipped or allegedly misleading.\r\n\r\nButler also was a witness in the room to several conversations that allegedly capture how Trump was positioning his closest aide Nauta, De Oliveira and others to thwart federal authorities.\r\n\r\nDe Oliveira told Butler, for instance, about Nauta traveling to Palm Beach in late June 2022, at a time when Nauta and De Oliveira were allegedly interested in deleting surveillance tapes of a storage room where the boxes had been kept at the club, according to the indictment.\r\n\r\nButler recalls that De Oliveira told him Nauta would be visiting. Then a day later, De Oliveira warned Butler that Nauta’s visit should be kept secret. De Oliveira told Butler that Nauta was interested in learning about how surveillance footage from the club would be saved – another oddity to Butler, he says.\r\n\r\nHe says he now looks back at his last few months at Mar-a-Lago with a clarity only the indictment of Trump could bring. The behavior of Trump and Nauta toward him –especially on days where investigators were seeking details from Trump – now make sense, like puzzle pieces that have come together, Butler says.\n\nButler, 41, is a natural narrator of the world of Trump in South Florida.\r\n\r\nHe has known Trump since 2002 and can recount detailed conversations with him, his family and guests at Mar-a-Lago. Butler worked alongside his closest friends at the club, first and foremost De Oliveira. The two would sing karaoke together or celebrate each other’s birthdays off property.\r\n\r\nBecause of his close-knit friendships, Butler has years of text messages and photos on his cell phone. His time as a chauffeur to countless visitors and Trump family members provided deep insight into the inner workings of Trump’s orbit.\n\nThe Florida native took the job working for Trump 21 years ago, as a seasonal valet at Mar-a-Lago making little over $30,000 a year. A man bubbling with ideas and energy, Butler pitched Trump personally a few years later about starting a car service for travelers visiting Trump properties in South Florida. It’s one of several businesses Butler has started to support his family.\r\n\r\nThe Mar-a-Lago car service grew into a major part of his life for a decade, eventually earning him more than three times his initial salary, he says, and empowering him as an entrepreneurial spirit who grew close to many in the social network around Trump.\r\n\r\nBut the MAGA approach to politics in recent years, the intensifying FBI investigation, and Trump’s apparently cavalier attitude toward national security soured Butler on staying at his Mar-a-Lago job after Trump’s presidency.\r\n\r\nDisillusioned with how the club had grown into a more transactional environment for Trump during his presidency, Butler quit Mar-a-Lago in November 2022. That year, he watched his friends and former co-workers’ lives become disrupted because of the developing criminal case.\r\n\r\nButler says now he believes Trump hasn’t just divided the country. He has also divided people’s communities, including his own two-decade relationship with his best friend De Oliveira.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@SH-sr5ol",
            "commenter_channel_id": "UCcSJsjZVzkK4ZNEOjKUK3fQ",
            "comment_text": "Trump is so damn crooked",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@mitseraffej5812",
            "commenter_channel_id": "UCqdqhcNyXYmN1OoVdTLu1Wg",
            "comment_text": "It beats me why Butler puts his face out there and I sure I hope he has adequate protection.",
            "likes_count": 9,
            "replies": []
        },
        {
            "commenter_display_name": "@user-xz7ty6xm6u",
            "commenter_channel_id": "UCIqIrGzLZyk6nxgsD-L2AwA",
            "comment_text": "You go Brian, lest you WILL join the Rikers island clan",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Transgender-GirL",
            "commenter_channel_id": "UC269Cu8nWRvNuk_ngjcvFMw",
            "comment_text": "😂😂😂🌟🔴🌟presidemT... donald j TRUMP🐘🇺🇸 ...we know... you wanT us too ...\"eaT BuGs\"...🐜🐜🐜🕷🕷🕷🍔 ...inna America🇺🇸",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@charlesphoenix4383",
            "commenter_channel_id": "UCNSx4EKUzyx9_eWgFw6fn8Q",
            "comment_text": "There's a smart man. Get his own representation. The truth is out there...",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ghettotrippin9498",
            "commenter_channel_id": "UCqIYIaVqtEuIm_8d-M1aG6Q",
            "comment_text": "That's strange. How did Jack Smith miss this guy? Considering he has unlimited lawyers, money & investigators on the case.  Perfectly timed interview trying to persuade the public & the judge trialling this case. Trial by public opinion!\n\"C'mon Man\"",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@greeneyedbandit7079",
            "commenter_channel_id": "UCwagVJIKy4DB9oLUMvRd5VA",
            "comment_text": "Trump sold us out!!!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@amazedsatsuma",
            "commenter_channel_id": "UCG0v7-Jh_mgTbxbPRMh-NUA",
            "comment_text": "Ladies and gentlemen, this is Employee Number Five\n🎵One, two, three, four, five\nEverybody Trump's inner circle, better come clean or you gonna fry\nFor the classified documents in the bathroom corner\nTrump's boys say they want me to block & hinder\nBut I really don't wanna\nSo I end up testifying to Smith all last week.\nI can't stay this deep because da Boss talk is kinda cheap 🎵",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-xf8uk7gr9m",
            "commenter_channel_id": "UCB21aKbMgbm9hCCl8YAmeFg",
            "comment_text": "All a kangroo court room",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@wmp3346",
            "commenter_channel_id": "UCbjc6P92dHW7dVtbVDjfSCg",
            "comment_text": "Does he have security?  Can’t imagine maga morons will appreciate this news",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@emanreminder8683",
            "commenter_channel_id": "UCivFBQ99RDbXT6lD6cBzq9Q",
            "comment_text": "If there isn't a search warrant issued for all of trumps other properties (and plane) for documents immediately, then I won't take this whole thing seriously.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@andrestamayo6509",
            "commenter_channel_id": "UClX48CTNNiNnrnl32CThOiw",
            "comment_text": "The innocent...usually do not ask for \"blanket immunity\".",
            "likes_count": 4,
            "replies": []
        },
        {
            "commenter_display_name": "@annietang3780",
            "commenter_channel_id": "UC_XiRParxg_EFmoFIsAUaVg",
            "comment_text": "More people know something about the illegal activity of their boss, they need to come out for the sake of justice. One should be loyal to his country, the truth, not to any individual.",
            "likes_count": 3,
            "replies": []
        },
        {
            "commenter_display_name": "@macsmith2013",
            "commenter_channel_id": "UCMf-PcK5cjVgke6Q0NxW0_A",
            "comment_text": "Too bad that out of all the cases against Trump, this is possibly the most unlikely to actually come to trial, let alone a conviction.\nNot coincidental, of course.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ivanlaberge1193",
            "commenter_channel_id": "UC5cQzmrdR7wajS0hGebZt2w",
            "comment_text": "He don't know what is classified or not",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@flodareltih9825",
            "commenter_channel_id": "UClDeQP6SybAkhrjmupaFR9A",
            "comment_text": "I dunno this guy.  Never met him.\n-Dunno Trump",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@danielcadnum7214",
            "commenter_channel_id": "UCeCB0qPf6gnGROLf_VtFWVg",
            "comment_text": "So, the “Butler” did it?  😂",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@worldlife9834",
            "commenter_channel_id": "UCHo9LjH3oq-7E5WaUee13Pw",
            "comment_text": "Political persecution is a characteristic of communist countries.  Democrats are extremely dangerous to freedom of speech.  Google, Apple and Microsoft suppress voices who oppose their agenda's.  Both Republicans and Democrats refuse to impose new laws on technology companies who violate our freedom of speech and expression.",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@user-xf8uk7gr9m",
            "commenter_channel_id": "UCB21aKbMgbm9hCCl8YAmeFg",
            "comment_text": "George Stephanopoulos should be fired he knows Trump was NOT charged for rape he and other Media peoole are disgusting and all should be fined big when they lie like George Stephanopoulos did.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@DarkPesco",
            "commenter_channel_id": "UCsWX5s0upFfW8W_a4jagvaA",
            "comment_text": "His incessant smiling of such a huge grin when he's talking about aiding in the commission of crimes against our country...is creepy, at minimum.  I think he knew and is lying to save his skin!",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@jaymfom6963",
            "commenter_channel_id": "UCgV3_9s3Nqs74nWo43m7F3Q",
            "comment_text": "Why would his lawyers let him give this interview before the case is heard? Why would Jack Smith let this out! Not a good way to go! It may backfire!",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@sethabel4315",
            "commenter_channel_id": "UCgOasM7sRYl2eUQQ51BpgZQ",
            "comment_text": "Have they got him yet??",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@deborahmulkey1627",
            "commenter_channel_id": "UC0uG0svrBFQ_KzzkB5IwyVQ",
            "comment_text": "Kind of makes me uncomfortable with this guy smiling so much.\nThey need to make sure that he didn't know who's in those boxes, cause he may just be trying to dig himself out Of the quagmire",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@UWI-Anna",
            "commenter_channel_id": "UCsJNTm6jZetDs-yj-AIB6fQ",
            "comment_text": "CSCS Walt Nauta is a disgrace to the US Navy.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@PinkPoodleVoo-Doodollcon-ob6mn",
            "commenter_channel_id": "UC2KR7eBT-FkjAqnyzden52w",
            "comment_text": "How can you not ask him why he is dressed exactly identically to expotus?",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@traceyaus7453",
            "commenter_channel_id": "UCSNT6CL6hIDdDSNSDQfgu1Q",
            "comment_text": "Johnny number 5",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@robkoper841",
            "commenter_channel_id": "UCmRzQdiiQvlkmo6P1tUuYkg",
            "comment_text": "Employee Number 5 may be turning states' evidence, but that ultra-long, tacky necktie is still loyal to Trump.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ivanlaberge1193",
            "commenter_channel_id": "UC5cQzmrdR7wajS0hGebZt2w",
            "comment_text": "Biden need corrupt justice to became president.\n Looser",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@eyesurvivedmyself",
            "commenter_channel_id": "UCE5Zl5EylBk0xsl5hqp-UtA",
            "comment_text": "Absolutely telling the truth! Woah!!!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@christinefuss9585",
            "commenter_channel_id": "UCYBLvusM2aY8SYLajnx4VuA",
            "comment_text": "GEEZ THAT'S ALOT of boxes! I thought it was just a few in the bathroom. That's like 3 or 4 different bunches ! How do investigators know he didn't copy anything?\n He clearly took them to sell .",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@sixbladeknife44",
            "commenter_channel_id": "UCZYBS1dSfiDx6kva3sOeE7w",
            "comment_text": "Sounds like a mob family tv drama SMH",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@gregbelcamino7239",
            "commenter_channel_id": "UCMlZD0O-J8ZlG_eGy5S6SjA",
            "comment_text": "Judge Cannon, are you watching?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@toneyingram732",
            "commenter_channel_id": "UCpysO_m-_eY9TK7J7LseMng",
            "comment_text": "The truth always come out about Satan lie",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@robwi7369",
            "commenter_channel_id": "UCE3GhOBgcCV8z2Fde5hFZlg",
            "comment_text": "How does he know it was classified documents in the boxes?\nYou guys have lied too many times for me to just believe circumstantial evidence like you just showed.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@burntorangehorn",
            "commenter_channel_id": "UCRT42YlV8noCgtADmGihFlg",
            "comment_text": "Sounds like DOJ actually did have probable cause to search Bedminster, but didn't. More special treatment of Trump.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@cgi9498",
            "commenter_channel_id": "UCJmaC1PziwuB3o6vQe4NvNg",
            "comment_text": "More nothingburger!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@joeberean172",
            "commenter_channel_id": "UC7pjSn2FsPQj3-OkEYEqIFg",
            "comment_text": "What a joke",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Bloipapp",
            "commenter_channel_id": "UCXcF6lr87MUoDx4JuQCwL2w",
            "comment_text": "Wow what a revelation. They found somebody who was stacking the boxes and had no idea what was inside. How brave he came forward. We've all learned a ton of information from this. Thanks Employee number 5!",
            "likes_count": 9,
            "replies": []
        },
        {
            "commenter_display_name": "@davidjames2083",
            "commenter_channel_id": "UC2RZQBlsVgPX83gFkYtj81g",
            "comment_text": "*This Butler geezer needs to watch out for a Cuban hit-man, hired by Judge Aileen Cannon and Ted Cruz's father! (HE'S NOT DEAD! )*",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ivanlaberge1193",
            "commenter_channel_id": "UC5cQzmrdR7wajS0hGebZt2w",
            "comment_text": "CNN bullshit",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jmcm8546",
            "commenter_channel_id": "UCB0mxgXBAGtageSYvtgxD_w",
            "comment_text": "Why wasn't Bedminister raided by FBI also? This was so loose by the authorities",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@shawnastephens1536",
            "commenter_channel_id": "UCtSr5MiQiLOWULcer6PgKeQ",
            "comment_text": "I we will ever get a trial.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jsmcguireIII",
            "commenter_channel_id": "UCk3HREluapi1cF-soKd_8ww",
            "comment_text": "Butler already delivered his sworn testimony, so all the MAGA threats to him and his family have no power over him.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@peterb6282",
            "commenter_channel_id": "UCbflNJ6pOEv2CX0lTI-I9sw",
            "comment_text": "#5 is the perfect witness. He wasn't angry had/has no reason to lie. I'll admit I was a bit surprised at how jovial and pleasant he was..you get so you expect the angry, sketchy, defensive person that is so common in tRumps world.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@1176hambone",
            "commenter_channel_id": "UCtLI_vOslR8c5iwS3mDEa9Q",
            "comment_text": "volume is very low",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@KrustyKlown",
            "commenter_channel_id": "UCH4bSEapGQObt7toQE6CWaA",
            "comment_text": "WHERE did Trump's plane take those 15 boxes ???",
            "likes_count": 4,
            "replies": []
        },
        {
            "commenter_display_name": "@lmak-rf9fn",
            "commenter_channel_id": "UC0hCNfgOLexEtKAxbh4mZDg",
            "comment_text": "Trump and his entire family is selling our secrets.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ThePriceMaster",
            "commenter_channel_id": "UCoqLGKbFDsQn6gUqWd94zLw",
            "comment_text": "What's the bombshell? He kept documents in boxes?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@nw9353",
            "commenter_channel_id": "UCjJC3wyc5ZooSBivud2mBDw",
            "comment_text": "Find the documents in New Jersey then you can prosecute in New Jersey.",
            "likes_count": 2,
            "replies": []
        },
        {
            "commenter_display_name": "@susanschaffner4422",
            "commenter_channel_id": "UCe8grKcKg82uu4zdv975-JQ",
            "comment_text": "But did he see personally the documents?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@karenjohnson5271",
            "commenter_channel_id": "UCyGxx3VItRH64_wcXe5GjUw",
            "comment_text": "Drivers,bar staff, etc. are invisible.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@doug6723",
            "commenter_channel_id": "UCrxJV75i2BYlcXgd_VJxJtQ",
            "comment_text": "We're kind of missing the part of the interview where they reveal where those docs went? Remember they found some at Mar A Loser. Where did these other boxes go? Now you know how much the Saudis will pay for top secret docs.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@gleeburk",
            "commenter_channel_id": "UCHe3x8F9jrfXkiug5XRckLg",
            "comment_text": "Jeffrey Epstein knew too much also.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@lindaswanson9328",
            "commenter_channel_id": "UCyY5WanUGh9ZnoUtC8SY3kQ",
            "comment_text": "Jack Smith needs another search warrant for maralardo. There's more. If it hasn't already been sold to the highest bidder.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jamiepettway7614",
            "commenter_channel_id": "UC4zAlyRmSCSGRd8Gq4pSGyQ",
            "comment_text": "Lies",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@PoorChoiceOfWords1224",
            "commenter_channel_id": "UChct_4HuuoWoseKy-VPFdUQ",
            "comment_text": "\"Oklahoma LGBTQ suicide prevention line sees more than 230% increase in calls since Nex Benedict’s death\" - By Justin Gamble - Hey Justin Gamble, how many of those garbage calls would you take before quitting your job at CNN?\r\n\r\nBias Score: 6/10\r\n\r\nHelped:\r\n- The Rainbow Youth Project USA may benefit from increased visibility and support.\r\n- LGBTQ youth in Oklahoma may receive more attention and support.\r\n\r\nHurt:\r\n- The article may indirectly harm the reputation of Owasso High School and the broader Owasso community by associating them with the incident without presenting their side.\r\n- Oklahoma state policies and officials could be perceived negatively due to the framing of their actions in the article.\r\n\r\nLanguage:\r\n- Words like \"crisis,\" \"scared,\" \"worried,\" \"hurting,\" and \"fear\" evoke a strong emotional response and may be seen as biased toward generating sympathy for the LGBTQ youth.\r\n- Describing the political situation as \"just hate and loathing\" employs emotionally charged language that may not fairly represent all viewpoints.\r\n\r\nViewpoints:\r\n- The article predominantly features viewpoints sympathetic to the LGBTQ community and does not appear to include responses or perspectives from school officials, state lawmakers, or those with opposing views on the legislation mentioned.\r\n- Although it references investigations by police and the US Department of Education, it does not detail any findings or statements from these entities.\r\n\r\nFacts vs. Opinion:\r\n- The article presents factual information regarding the increase in crisis calls, the death of Nex Benedict, and state policies. However, the interpretation of these facts and the causality implied (e.g., linking Nex’s death to the spike in calls) leans more on speculation or opinion without clear evidence provided in the text.\r\n- Statements from organizational representatives are presented as fact, with little distinction made between these perspectives and the article's narrative voice.\r\n\r\nContext:\r\n- The article might lack context on any existing support structures within Oklahoma or efforts made by the state or school to address LGBTQ concerns, potentially painting an incomplete picture.\r\n- The broader social and political climate in Oklahoma and its impact on LGBTQ youth is mentioned but not explored in-depth.\r\n\r\nSources:\r\n- The primary sources are representatives from LGBTQ advocacy groups. The lack of diversity in sources (e.g., school officials, state lawmakers, directly affected individuals) might contribute to a one-sided narrative.\r\n- The reliability of the sources used is not in question, but their perspectives may not encompass the full spectrum of views on the issue.\r\n\r\nConclusion:\r\nThe article focuses heavily on the impact of Nex Benedict’s death on LGBTQ youth in Oklahoma, painting a picture of increased fear and need for support within this community. While it effectively highlights the challenges faced, it does so with a clear bias towards the perspectives of LGBTQ advocacy groups and does not adequately represent opposing viewpoints or the responses from the school or state officials involved. The emotional language used and the selective presentation of facts contribute to a narrative that strongly advocates for one side of a complex issue.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@1L2R",
            "commenter_channel_id": "UC_7tLGmkGYBa1xSonB5V9Wg",
            "comment_text": "trump response \" I really don't know him \" 😆😆😆",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Albertk96",
            "commenter_channel_id": "UCbn6ZECPI1Gww9N05tT6yeQ",
            "comment_text": "Wow, these boxes have more sky miles than I do! Maybe It's time to ask thoes pilots a few questions?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@lastone8896",
            "commenter_channel_id": "UCdtL5jLXYEyRmFwbl4sHOFw",
            "comment_text": "Censorship very heavy on this subject thank you cnn",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@patrickmacintosh9223",
            "commenter_channel_id": "UC6MAsGLhw-IIxOl6aVwfnBQ",
            "comment_text": "He's coming back snowflakes, Haaa !! TRUMP-20/20 😊",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@Acer_Maximinus",
            "commenter_channel_id": "UCfb1uygb6mMS4pXOoKQP3cQ",
            "comment_text": "No one is as clueless as this smiling sycophant pretends to be.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jsmcguireIII",
            "commenter_channel_id": "UCk3HREluapi1cF-soKd_8ww",
            "comment_text": "All these MAGA losers suddenly have law degrees and feverishly repeat the Hannity nonsense like trained dogs. arf arf good boy!",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@alexanderkwamina4746",
            "commenter_channel_id": "UCrwANymjzRDVEM5wzVd38zw",
            "comment_text": "It's a great sign because his conscience didn't send him to Fox No News.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jrbspacecowboy",
            "commenter_channel_id": "UCLE23lT4z_vNebjKJ5vuIdg",
            "comment_text": "Do these guys all sit the same way?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@vonsuthoff",
            "commenter_channel_id": "UCEumZDswIX7Z8A_rP2mOPGw",
            "comment_text": "*The major malfunction of MAGAs... They only get one side of the news. That makes for a low info voter. They should at least Google \"Biden's Accomplishments.\"*",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@user-wh9vy2fx8y",
            "commenter_channel_id": "UCVpjhrIANLoaBnTcdA3zuJA",
            "comment_text": "Trump 🇺🇸 ❤🤍💙",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@kcbowman4042",
            "commenter_channel_id": "UC964TG89R3BgW_KMJfpTlQw",
            "comment_text": "wow.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@gregoryo8105",
            "commenter_channel_id": "UC4Z0NiP2s185zHJCE-6wY0w",
            "comment_text": "WHO CARES?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jimako6",
            "commenter_channel_id": "UCQR8n_EKMcP83FvUvoB3jLw",
            "comment_text": "It's beyond ridiculous delusional defendant drumpf is not remanded in custody awaiting trial",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@loftbuckleyrc",
            "commenter_channel_id": "UC-1r4gDUTxZSuuV3Mii9dGQ",
            "comment_text": "He will get the usual death threats.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@annemccormack9628",
            "commenter_channel_id": "UCzbflfT78N_tk4-u2PVGqUw",
            "comment_text": "Finally the truest is coming out its a bout time he should pay the price fot it now you should not vote  that man he would do it again",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@bluetextbooks",
            "commenter_channel_id": "UC30rbR1dNiHIaqL2Ja0FChA",
            "comment_text": "The Documents Case has a corrupt judge.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@user-wh9vy2fx8y",
            "commenter_channel_id": "UCVpjhrIANLoaBnTcdA3zuJA",
            "comment_text": "What about Biden's Documents 🤔",
            "likes_count": 1,
            "replies": []
        },
        {
            "commenter_display_name": "@michaelcatalano6950",
            "commenter_channel_id": "UCmEXzmipQawV6VgU3ZYg4eA",
            "comment_text": "Wouldn't it be better for the prosecution for Mr. Butler to keep this to himself until the trial?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@gleeburk",
            "commenter_channel_id": "UCHe3x8F9jrfXkiug5XRckLg",
            "comment_text": "Putin's puppet, for sure.",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@ajsmith6064",
            "commenter_channel_id": "UCQstMbKFrQ52iu16KkJaOlA",
            "comment_text": "The Teflon Don",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@suzanne9150",
            "commenter_channel_id": "UCz2zVYzrzS009NiGN_H82rw",
            "comment_text": "WHY did Trump take hundreds of boxes of classified documents?",
            "likes_count": 0,
            "replies": []
        },
        {
            "commenter_display_name": "@jjvsqz",
            "commenter_channel_id": "UC40ks8l8kkTpydW8CKr5-tg",
            "comment_text": "How can anyone consider TRUMP as POTUS again especially when we all know he will destroy our democracy?   HOW??????",
            "likes_count": 0,
            "replies": []
        }
    ]
}